{"02-Dance/Swing-and-Tango":{"title":"Swing and Tango","links":["Dance---Private/Swing/Swing-Dance-Competition-Accomplishments,-Awards,-and-Performances","Dance---Private/Swing/Shag/Collegiate-Shag-Demystified---A-Simple-Progression-for-Professional-Dancers","Want-Give-Have-Had/How-to-Get-Men's-Pants-for-Dancing","Tango-Class-Recaps"],"tags":["public"],"content":"2018 to Now - Swing Era\n\nWhile I still dance tango for fun and teach when asked, most of my focus is the swing dances, particularly Shag and Balboa. I’m doing my best to keep a log of all the Swing Dance Competition Accomplishments, Awards, and Performances.\nFirst intro to Shag was a class from Kate Elisabeth and Julie Roman in 2018 in Phoenix. Learned a bit from @Stephen Sayer and @Chandrae (Chanzie) Roettig Gomez. I was gifted several blood transfusions from @Julie Roman and that helped a lot. Planned to do a lot of traveling for Shag  in 2020… Back on track in 2023 and I’ve been enjoying participating in all the shag events and comps I can! I love coming up with new things, particularly rhythm changes. But realizing that all the things I’m “inventing” Jeremy Otth already put on instagram. Practicing and teaching regularly around the world.\nI’m currently working on putting together an expansive compendium in preparation to creating an online school. This is one of the article I’ve written to help sharpen my thinking and process: Collegiate Shag Demystified - A Simple Progression for Professional Dancers. I also write articles to help answer questions that I often hear from newer dancers. How to Get Men’s Pants for Dancing is an example of something I wish I knew when I started!\nAs I’m getting older, I’m finding Balboa is calling my name. I dance Balboa when I’m too tired, lazy, stiff, sore, hurt, chill, calm, or achy to dance Shag. I dance Balboa often and I’ve been pleasantly surprised that a lot of Salsa and WCS and Tango vocabulary and techniques can be imported into the dance.\nI dance Lindy Hop on teams or when the music is too slow for Shag or Balboa. I dance Blues when forced or tricked into it.\n2010 to 2020 - Puro Tango\n\nAfter studying in Argentina, in 2010 I began working independently as an Argentine Tango teacher. In 2014, my wife Stephanie and I won the USA Tango Championships and we decided to pursue dance full time. In late 2015 we moved to Phoenix, Arizona for economic opportunity.\nWe opened two studios, taught many private lessons, mentored to multiple national and international champions, and worked as instructors at UC Berkeley, Arizona State University, Empower College Prep, Arizona Opera, and Mesa Community College. Stephanie danced and acted in the Arizona Opera’s production of Maria de Buenos Aires.\nCombining all the tango training trips, I’ve lived in Buenos Aires for two years. This is why I have the Argentine accent while speaking in Spanish. All of my Spanish speaking friends make fun of me for it.\nIn Tango Class Recaps you can see a few class recaps from 2018 and 2019 when we teaching an open to all class in Phoenix at the language school Interlingua. We had a dedicated group of students where we applied the format of teaching moves while emphasizing fundamentals and adding 15 minutes of candy (stage-ish stuff) at the end.\nAfter this video of us dancing for fun in April 2019, Steph’s health started to take a turn for the worse. To continue dancing we detoured. I took up Lindy Hop and Shag and Steph started a coaching position with the Phoenix Swing Project.\n2005 to 2010 - Salsa and Ballroom\n\nIn 2004 I started with a general partner dance class. This was prompted by a cute girl asking me to go with her. I continued with dance and started learning salsa from a local community class in Orinda put on by Tomaj Trenda. In college I joined cotillion and learned ballroom dancing from the legendary Kenji Ota and regularly went salsa dancing three nights a week. In 2009 I started working as an a new student specialist at Arthur Murray, Hayward."},"03-Infill,-Construction,-and-Planning/Construction-Management-Specialization---Self-Teaching-in-Progress":{"title":"Construction Management Specialization - Self Teaching in Progress","links":["04-PKM-and-Coding/PKM-and-Learning/How-to-Read-Fast","04-PKM-and-Coding/PKM-and-Learning/How-to-study-and-learn"],"tags":["project","public"],"content":"Applying How to Read Fast, How to study and learn, PKM system - Knowledge organization, acquisition, and production|PKM system\nSkelton from Columbia University Construction Management Specialization\n\nConstruction Project Management\nConstruction Scheduling\nConstruction Cost Estimating and Cost Control\nConstruction Finance\nThe Construction Industry: The Way Forward (Construction Industry Overview, Sustainability in the Construction Industry, Building Information Modeling and Technology Trends in Construction)\n\nInitial Questions\nWhat is construction scheduling? Is it more unique than understanding the trades timelines and delivering appropriately?\nWhat’s unique about cost estimating or control?\nConstruction Finance I don’t know anything about. Finance in general so there’s a hole.\nFuture of industry would be interesting.\nConstruction Cost Estimating and Cost Controls\nwww.youtube.com/@planandspec/videos\nwww.youtube.com/watch\nwww.youtube.com/playlist\nIan Taylor, project manager for Turner and Townsend, introduces the stages of design in a construction project.\ntypes of cost estimates in a construction project. Also covered in this module are the tools and methods used to create estimates.\ndiscuss Quantity Take Off and Measurement. Estimating cut and fill costs is taught along with a detailed example of using cut and fill software. Also covered in this module is the topic of deep foundations, concrete foundations and structural steel, measurement, masonry, glass curtain wall, facade and wall finishes.\ndiscusses pricing, labor costs and equipment costs. Topics include, cost materials, formwork, reinforcing steel and concrete. Money component and productivity component is discussed in labor costs, as well as estimating equipment costs.\nillustrates how to build an estimate. Sneath does a deep dive into a schematic design project.\ndiscussed the procurement stage of a construction projects and they typical involvement of a cost manager or cost estimator.\ndiscusses post contract and cost estimation with a construction project. Also covered in this module are cost reporting, change orders and communication and meetings.\nconstruction cost control and the work segments contained in a project.\n Earned Value Method of Cost Control.\n  introduces cost management close out and punch-list review.\n   talks about cost estimation in general practice. The unit starts with tips in cost estimating and cost management and ends with a discussion of the international roles of cost managers.\n   discusses contracts and cash flows. Revenues, expenses and how they impact projects as a whole will be covered.\n   discusses technology trends in cost estimating and cost control. Topics include 5D Estimating Systems (BIM), estimating software, technology workflows, and implementation.\n   discusses cost control for large programs.\n   presents this module on Lean In Cost Control.\n1. Construction Project Initiation and Planning\nThe five phases are: pre-design, design, procurement, construction and monitoring, and post-construction. There are also sub phases.\nHave a good Construction Contract Types|contract that sets forth terms of how things are gonna go. Lot’s of variety here, lots of different ways to divide up risk and responsibility. The contracts also say how things get done aka Construction Project Delivery Methods|project delivery methods. Surety bonds are often required so people stick to their word. Costs about .5 to 3% depending on insurers formulas.\n\n\n                  \n                  Surety Bonding \n                  \n                \n\nbasics of surety bonding  3 person agreement between principal (contractor), obligee (often a government entity), and surety. Obligee is protected if principal defaults. Surety will pay. And the principal will settle with the surety. No losses expected. Uses 3Cs to determine. Capital Capacity Charter (project size, the contractor’s creditworthiness, and the bond amount). Came about because of Miller act of 1935. Protects Owner, Builder, Sub 1, and Sub 2. But what about sub 3? Is this how Trump didn’t pay? Slightly different from insurance where it is 2 parties and losses are expected. Instead, a surety bond is more like credit earmarked for cases of default. They cost between .5% and 3% of project to purchase. There are different types of surety bonds for each phase of the project.\nYou can use construction cost codes, BIM, and a work breakdown structure  so stakeholders know you’re organized and legit and they can trust you know what you’re doing. Having your  managerial accounting, empowered by cost codes, in good shape means you’re going to be in business so people can trust you.\nIf you’re managing lots of projects (and managers), you’re a program manager.\nConstruction (changing sites, custom, high skill labor) vs manufacturing processes (one site, repetitive, low skill labor). Manufacturing gains in construction focuses on how to reduce costs.\nQuestions\n\nAre there good infill developers? - yes\n\nwww.councilofinfillbuilders.org/about-us/board-of-directors/\nwww.councilofinfillbuilders.org/about-us/advisory-committee/. Notice @Patrick Kennedy is on this list…\nrpa.org/work/reports/how-six-cities-are-creating-missing-middle-housing\n\n\nWhat kind of manufacturing gains could be applied to make them more profitable?\nWhat does lofi to highfi bidding/quoting iteration process look like for complex projects?\n\n2. Construction Scheduling\nGotta schedule good and manage delays. Lots of ways to do this, not all that difficult, just need to follow procedure.\n\n\n                  \n                  Scheduling Keywords \n                  \n                \n\ndifferences between calendar dates and work dates\nGantt charts\nActivity Precedence Diagrams, also referred to as Activity on Node Diagrams, which graphically represent the construction activities in a project and their relationships\ntypes of construction activity relationships encountered in a construction project and how to represent them in an activity precedence diagram\nForward and Backward Pass Calculations are covered in this module. Forward Pass Calculations determine the minimum dates at which each construction activity can be performed and, ultimately, the minimum duration of a construction project. Backward Pass Calculations compute the latest dates by which each construction activity can be performed without increasing the projects minimum duration.\ncritical path??\nactivity float - total float, free float, interfering float and independent float. - how much delay slack and cause and effect are we talking about for each activity\nActivity on Arrow diagrams\nThe Program Evaluation and Review Technique (PERT) is introduced in this module which relates to uncertainty in estimating the duration of construction activities in a project schedule. PERT helps project managers determine the probability of a project being completed in a certain number of days.\ndiscusses the role of the scheduler in a construction project\nlinear construction; projects that have linear, or repetitive, properties. Also covered is the Line of Balance scheduling method which is a way of allocating resources for repetitive processes.\nIntegrated Master Schedule and identifies key features\nRisk Allocation and Planning"},"03-Infill,-Construction,-and-Planning/Infill-and-Missing-Middle-Real-Estate-Development":{"title":"Infill and Missing Middle Real Estate Development","links":["03-Infill,-Construction,-and-Planning/Construction-Management-Specialization---Self-Teaching-in-Progress","03-Infill,-Construction,-and-Planning/Parolek2020TheMissingMiddle"],"tags":["public","construction","urbanPlanning","project"],"content":"Under Construction\nEducation\n\nConstruction Management Specialization - Self Teaching in Progress\nParolek2020TheMissingMiddle\nGarcia2024MakingMMHousingPencil\n\nResources\n\nThe Terner Center for Housing and Innovation - UC Berkeley - research\n@Urban Machine - wood recovery\nternercenter.berkeley.edu/research-and-policy/\nBerkeley missing middle housing: berkeleyca.gov/sites/default/files/documents/02_2022-02-16_ZORP%202_Missing%20Middle%20Illustrations_Attachment%201.pdf\n\nRead List\n\nLive Work Planning and Design\nInfill Real Estate Investing - Proven Success Strategies for Urban Development Projects\nCreating Wealth Through Urban Infill Real Estate - by Randy Palazzo\nForm Based Codes\nThe Perception of Density\nwww.amazon.com/Building-Small-Toolkit-Entrepreneurs-Communities/dp/0874204682\n"},"03-Infill,-Construction,-and-Planning/Parolek2020TheMissingMiddle":{"title":"Parolek2020TheMissingMiddle","links":["tags/opportunity","@Union-Studio-Architecture--and--Community-Design"],"tags":["reference_note","public","opportunity"],"content":"Missing Middle Is…\nBetween single family and high rise. Multiunit or cluster type compatible in scale with single family with urbanist metrics (walkability, price diversity). Usually 4-8 units in building or lot, up to 19.\nBottom Line\nPeople want it. Really good for the country. Existed historically. But, because of regulation, lack of systemic support, and uncertainty, it is hard to make it profitable now a days. Currently a niche market. But some are able to do it successfully. Cities effectively regulate these types with form-based coding.\nPeople and Places Doing Good Works has tremendous networking value.\nRelates To\n\nGarcia2024MakingMMHousingPencil\nParolek2020TheMissingMiddle#People and Places Doing Good Work|People and Places Doing Good Work\n\nNotes\nQuotes\n“Even outside of the affordability and attainability conversation, the simple realities that 30 percent of all households across the country are single persons, that family sizes are decreasing, and that a large percentage of the population is aging and wanting to downsize are reasons enough to want to incentivize and remove the existing density-based barriers and disincentives for the delivery of small units.” - pg 95\nBecause of their simple forms, smaller size, higher yields, and type V construction, Missing Middle building types can help developers maximize affordability and returns without compromising quality. - pg 45\nScale and Form\nPerceived density should be low. Use form and scale matters, not number of units, FAR (floor area ratio), lot coverage, or multifamily.\nFear of density. Have convos and get ahead of community or neighborhood opposition.\n\nGather local examples (santa barbara story du/acre). Lots of image assets in Chapter 5 of book.  Excellent zoning reference as well for each type.\nUse local terms (if positive.)\nFrame convo: Missing Middle Housing, good list, House-scale, Housing choice, Attainability: where will teachers, firefighters, police, your children live in your community?\nDO NOT use terms density, multifamily, and upzoning.\n\ngood list: Duplex(side by side, stacked), cottage court, pocket neighborhood, fourplex stacked (1br/2br, parking vars), townhomes, triplex stacked, multiplex medium aka mansion apartment, courtyard building, live work. note most buildings can be alley/front loaded variations. note, live work was done really well in past, really bad today.\nbad list: dingbat, slotted townhomes\n\n\n                  \n                  more building details a la zoning and standards \n                  \n                \n\nTwo to two and a half stories maximum (Third story with careful consideration.)\nHouse scale is 55-75 ft. maximum width along the street. Sometimes with wings that takes the total width up to 85 ft. along the street; 55-65 ft. maximum depth. Both the maximum width of the main body and the maximum width including the wings are important and thus crucial to regulate.\nMaximum of one off-street parking space per unit, preferably not embedded in the building. Single-wide or narrow driveways if no alley is present.\nPrivate open space is not needed and should not be required. Shared open space exists in the form of a rear yard, sometimes as a side a yard, or a courtyard.\nMix into block, put on “end grain”, or put in transition to high density. aka small individual lot infill, secondary corridors, transitions from higher-intensity corridors. Downtown transitions, new growth edge areas. lol, good luck in zoned “single family neighborhoods”\n\n\nMoney\nPlanning and zoning have setbacks, maximum densities, minimum lot sizes. This gap is often present even in recently updated zoning code.opportunity\nIdentifyopportunity  by Review the Comprehensive Plans (City, County, or Both), Review the Small-Area Plans, Review Zoning. For how to specifically go about this, look at chapter 7.\nSavvy developers use high end finishes and target walkability market and have no competition.\nconstruction types: V verses I or III\nChapter 6 has a few general profit loss breakdowns.\nBarriers\nLarger buildings (125-150 units) provides easier-to-identify and often larger cost efficiencies than building four-, eight-, or even a sixteen-unit building or series of these buildings. Major reason larger builders and developers, who are looking for higher returns on their investments, are not building and why MM are mostly being built by smaller builders and developers.\nre Manufacturing gains in construction Efficiencies can be found elsewhere, such as repeating unit plans and counting on-street parking toward parking requirements as shown in the Prairie Queen/Urban Waters case study.\n\n\n                  \n                  Impact fees make multiple smaller units economically infeasible \n                  \n                \n\nImpact fees are charges paid by the developers of new developments to a municipality to provide new or expanded public facilities (such as roads, sewers, schools, fire and emergency response) required to serve that development. The big issue with impact fees, in terms of them providing a barrier for Missing Middle Housing, is that the fee charged for a unit is typically the same regardless of whether it is 5,000 sq. ft. or 500 sq. ft. Adjust impact fees based on unit size, SO smaller units pay less, and by context (infill versus greenfield).\nThe irony is that the unintended consequence of this type of pushback is that larger projects are incentivized because they are the only ones that have the funding and the tolerance to risk making it through entitlements. see @Jon Jon JPeg ig video about “bread” type housing and devleopment patterns - www.instagram.com/p/C4eHB-9Lx49/\nAccessibility - added cost and complexity. 4+ has same codes as giant devs\nA possible remedy would be the completion of a specific analysis of Missing Middle-scale buildings, three stories and nineteen units maximum, related to these building code requirements to determine if it would be possible for them to qualify for existing IRC requirements or similar, rather than more restrictive and costly IBC compliance. As far as the authors know, no such analysis is being considered. pg 107opportunity\nCondo Issues\nCondo projects require builders to more insurance because of 2000s era laws. Builders will get sued. Difficult to get financing to build and to buy (FHA). Condos require HOAs and HOA formation costs are the same at any scale.\nPolicy\nRECOMMEND CHANGES TO PLANS, POLICIES, AND ZONING - see chapter 7\nSee case studies as well: oregon, twin cities, minneapolis, saint paul, michigan, atlanta georgia, nashville, chattanooga, california, include Grass Valley, Ventura, Livermore, Petaluma, Hercules,\nBenicia, and Paso Robles.\nPeople and Places Doing Good Work\nHere is the organized information in the bullet point format you requested:\n\nAlliance for Housing Solutions Housing-advocacy group in Arlington, Virginia. Organizing to get ahead of the housing conversation.\nOpticos’s Design Hired by groups such as Holmes Homes and Isla Vista.\nBrown Design Studio Involved in the East Beach project in Norfolk, Virginia.\nAARP Champions Missing Middle Housing through its Livable Communities initiative.\nPlaces doing positive zoning work: Medford, Oregon; State of Oregon; Novato, California; Flagstaff, Arizona; Denver, Colorado; City of Minneapolis; Cincinnati, Ohio; Miami, Florida; Beaufort County, South Carolina; Kauai County, Hawaii; Paso Robles, California; San Francisco; Kansas City; Davis, California\nBuilding a Better Bend Bend, Oregon nonprofit organizing ahead of the housing conversation.\n@Real Estate Groups Realtors and development-industry stakeholders in Greenville, South Carolina, and Coeur d’Alene, Idaho, have raised money and hosted events for Missing Middle Housing education.\n@Jim Heid - Small Scale Development Forum created to gather smaller, creative developers to discuss project experiences and lessons learned.\nIncremental Development Alliance Nonprofit training non-developers on how to develop Missing Middle Housing.\n@Dan Bertolet Condos expert at Sightline Institute.\n@CASA Formed by the Metropolitan Transportation Commission (MTC) and Association of Bay Area Governments (ABAG) for condos.\n@Cresolus Architects Architects specializing in tropical regions.\n@Garlynn Woodsong Urban planner turned builder and broker in Oregon; based at 6817 NE Seventh Avenue, Portland, Oregon.\n@David Spence Community-development specialist who founded Good Space after falling in love with the area while working for a CDC.\n@Eli Spevak and Zach Parrish Small-scale local builders in Portland, Oregon; developers of Cully Grove.\n@Union Studio Architecture @Union Studio Architecture &amp; Community Design Community Design Based in Rhode Island.\n@Jerry Reimer Involved with Urban Village in Omaha, Nebraska, partnered with Scott Semrad.\n@Richmond Livable Corridors Project in Richmond, California.\n@Culdesac Notable urban development project.\n@Jim Tischler Works with Michigan State’s Land Bank Authority.\n@Donlyn Lyndon Faculty member at UC Berkeley and mentor to Parolek, former partner with Charles Moore.\n@Charles Moore Codesigner of Sea Ranch and author of The Place of Houses.\n@Allan Jacobs Author of San Francisco’s first urban design plan in 1971, wrote Great Streets and The Boulevard Book.\n@Michael Southworth A Kevin Lynch protege from MIT, author of Streets and the Shaping of Towns and Cities.\n@Daniel Solomon Cofounder of the Congress for the New Urbanism, author of Building, Global City Blues, and Cosmopolis.\n@Peter Bosselmann Established urban-simulation labs in Berkeley, Milan, New York City, and Tokyo; author of Urban Transformation.\n@The Perception of Density Report questioning the validity of using density as a zoning metric and exploring how forms affect perceptions of density.\n@Bryan Suchy Coauthor of The Perception of Density.\n@Marshall Foster Became planning director of Seattle and coauthor of The Perception of Density.\n@Peter Katz Author of The New Urbanism and known for building type diagrams.\n@Andrés Duany and Elizabeth Plater-Zyberk Authors of Towns and Town Making Principles.\n@Charles Correa Famous Indian architect with a focus on vernacular, community-oriented design.\n@Form-Based Codes Book emphasizing the importance of Missing Middle Housing types.\n@Form-Based Codes Institute Nonprofit think tank dedicated to form-based codes.\n@Congress for the New Urbanism Advocacy organization focused on new urbanism principles.\n@American Planning Association Professional organization in the field of urban planning.\n@New Partners for Smart Growth Organization dedicated to promoting smart growth principles.\n@Charles Leinberger and Linda Pruitt Authors of Getting to Small Footprint Density.\n"},"04-PKM-and-Coding/How-I-Publish-This-Site---Obsidian-with-Quartz":{"title":"How This Site Is Published","links":["Website/test-file","tags/someday"],"tags":["public","code","project","someday"],"content":"Obsidan, Quartz, and Github pages are used. I made a script to move public files from the Obsidian vault to the Quartz folder for publishing. Links to private pages are removed. scan-for-markdown-code-display-page|see code\nReference\nMake a file executable in Terminal on Mac\ncompile ./scan-for-mkdown.sh\nview locally npx quartz build --serve\npush npx quartz sync\ntest file\nTo Do - Mini Steps\n\nGet own domain\nburnout dataview\npublish front matter\ncss design for obsidian and quartz\nsee if I can get anchors to work on quartz publish\n\nLog\n2024-10-20 did some design work to really focus the direction I want this site to go. Quite accidentally recreated exactly how Jackie already made the explorer. The issue with the explorer as it is right now is because I’m copying content over, it looses the file/folder structure. So now… I have to figure out how I want structure the file/folder arrangement. It kinda forces the issue for me to organize the fold/folder structure. How the heck do I want to do this in a sustainable way? Solution: bankruptcy. This is another evolution of organization so I’ll follow the advice of not going back and redoing everything. Just do it this way from this point forward. Need to update code to write folder structure.\n\n2024-10-06 taking another look at the css. Tailwind might be the ticket. How do use tailwind? But maybe first, update code to disable links that aren’t public. - done\nThen, tweak 404 page to use a back button or home. github.com/brandonkboswell/quartz/blob/hugo/layouts/404.html\n\nupdate and test code with ggrep, reference chatgpt.com/c/cc0ad39b-6d32-4114-890d-870e64317ecb ➕2024-10-06 - done\n someday figure out how to add target=&quot;_blank&quot; rel=&quot;noopener noreferrer&quot; to external link creation. I think this is the creator for internal links, now I need find the one that does external links. Open the quartz folder in vs code and search. ➕2024-10-06\n\n2024-10-04 Tweaked some of the colors for the light theme.\n2024-09-07 from Forte2022BuildingASecond Brain make ideas surfaced. Forte2023PARA make project focus. ADHD overwhelm, just mini steps. Anyone of them is fine to do. When done list as done on that day.\n2024-09-01 added Prius project.\n2024-08-30 How to “burnout” dataview to quartz. This is important for eventual list of note taking apps table. BurningOut Dataview To Markdown\n2024-08-20 Would like to publish front matter since it contains source information. Already a known issue may be fixed in the future. Wait on this. github.com/jackyzha0/quartz/issues/1208\n2024-08-15 Quartz removes single return line breaks. Must be double. Consider fix since its a typical style I use when writing in Obsidian.\n2024-08-09 Issue with image files that have custom display i.e. ![[urban-garden-japan.jpg|300]].  How to solve this? v1 would be remove the |300 so it be uploaded at all. v2 would be to figure out how to reincorporate it into the site display. Close to having enough things to track to implement an issue tracker: github.com/ljavuras/obsidian-power-tools/tree/main/Issue%20Tracker\nUpdates wanted:\n\nfix sed regex - done\nupdate media file creation/update logic to avoid unnecessary copying - done\nupdate file creation/update logic to avoid unnecessary copying… is this worth it?\n\n2024-08-08 Working on media links. Oops! Unending loop on @RyanMarin file. Because self-linked. Since scanning whole vault, no recursion is needed. Think about process, design, and performance. Maybe add back in, maybe. Fixed media links, was greedy a regex issue.\nshare code question\n\nha, found same idea. scan vault for publish tag www.ssp.sh/brain/public-second-brain-with-quartz/\ninteresting but no forum.obsidian.md/t/raw-embed-of-javascript-into-a-code-block/47950/3\nplugin option Embed Code - works locally, but not in publish process… I can use the embed for easy copy and paste but something tells me it isn’t going to be possible or easy. If I return to coding I should probably be using github anyway. Moving on.\n\nPATH: &quot;vault://code/obsidian-publishing/scan-for-mkdown.sh&quot;\nLINES: &quot;11-13&quot;\nTITLE: &quot;scan for markdown test&quot; \n\nUpdates wanted:\n\nbundle find-markdown.sh and npx sync quartz\nupdate css design of site\n\n2024-08-06 Unsure about customizing technology I know little about or if help will arrive. Attempting to use quartz in normal way, but writing terminal script to copy files tagged public to quartz to automate process. Script works. Updates needed:\n\nalerts on linked files that aren’t public?\nfix search, copy, and linking of media files - done\nset grep search to - public instead of just public. An author or source name may have that. Or location. - done\nQuestion:\nhow to share code? not markdown and not front-matter. does quartz support this? - done\n\nI didn’t want to mess with copying files to the content folder of Quartz since it would add significant friction.\nOliver Falvai had a nice way of doing this but it didn’t work for me.\nDecided on using bash, something I’m more familiar with, to get it done.\n2024-08-05 joined discord group, made contact with Oliver. He offered suggestions. Didn’t work. Wrote detailed question to clarify.\n2024-08-04 issue with blending github publish and maximum efficiency work. Private messaged Oliver on Mastodon\n2024-08-03 Started research and work\nwhen updating, from quartz folder run:\nnpx quartz sync --directory=../digital-garden\nwhen local testing run:\nnpx quartz build --directory=../digital-garden --serve\nlocal test no problem.\n`npx quartz build —directory=../digital-garden —serve\n\nworks great locally!\n\nfrom terminal with standard .yml file from install docs\nnpx quartz sync --directory=../digital-garden\n\nThis builds a blank quartz instance in github pages.\n\nUpdate .yml file to:\nnpx quartz build --directory=../digital-garden\nrerun:\nnpx quartz sync --directory=../digital-garden\n\nThis builds a broken quartz instance in github pages.\n\nTest “normal” workflow. Make obsidian vault the content directory. Add content.\nUpdate .yml file to:\nnpx quartz build\nrun:\nnpx quartz build\nnpx quartz sync\n\nthis works just fine, but doesn’t follow Oliver’s process.\n\nQuestion and Understanding\nIF I understand correctly, the file structure locally for Oliver’s system is supposed to be\nfolder/\n    digital-garden/\n        obisidan-files-and-folders.md\n\tquartz/\n\t\t.git/\n\t    .git-stuff/\n\t    content/\n\t\tpublic/\n\t\t    this-is.xml\n\t\t    what.html\n\t\t    quartz.js\n\t\t    builds.css\n\t\tquartz/\n\nThis works great locally.\nAfter sending the stuffs to github, the directory structure looks like this.\nquartz/\n\t.git-stuff/\n\tcontent/\n\tpublic/\n\t\tthis-is.xml\n\t\twhat.html\n\t\tquartz.js\n\t\tbuilds.css\n\tquartz/\n\nSo, when the github pages server runs the npx quartz build --directory=../digital-garden command from the .yml file, it doesn’t work. There’s obviously no digial-garden directory to build from. I made the git repo inside the quartz folder. Pushing my whole vault to a public github repo wouldn’t make sense. So, how do I make this work with your workflow?\nSide question for my understanding, why is the github pages server being instructed to build quartz again? It seems like all of the needed files are in public directory.\nResources\nquick git refresher: rogerdudler.github.io/git-guide/\n\nbest ways to self publish from reddit and ceo\nquartz\n\nvideo walk through of quartz\nadjustment to publishing with quartz for maximum efficiency \n\n\n"},"04-PKM-and-Coding/PKM-and-Learning/Capture-System":{"title":"Capture System","links":[],"tags":["permanent_note","public"],"content":"Shottr for screenshots and converting image text to copy and pasteable text. Great for snagging highlights and quotes from DRM books. Lots of impressive features beyond stock installed screenshot app. Safe.\nRent books reading from Libby.\nAudiobooks make sure to use your brain to ingest note size.\nSave read later articles with Omnivore.\n\n check out www.simplykyra.com/blog/use-a-simple-bash-script-to-resize-your-images-quickly-and-easily/ and see if it is worth integrating to reduce screenshot size load. Rarely need HQ. ➕2024-10-18\n"},"04-PKM-and-Coding/PKM-and-Learning/How-to-Read-Fast":{"title":"How to Read Fast","links":["04-PKM-and-Coding/PKM-and-Learning/How-to-study-and-learn"],"tags":["permanent_note","public"],"content":"Define terms:\n\nSpeed - input speed\nComprehension - understanding speed\nEncoding - retainment aka learning speed\n\nWhich do you want to do? Could be broken-barrel-learning-skills.excalidraw situation.\nSpeed\nKill internal monolog using www.spreeder.com/app.php, use a pointer, group words, use peripheral vision.\nComprehension\nApproach non fiction non linearly. Be your own teacher and build your own knowledge lofi to hifi. Don’t just read. Use the TOC, the first sentence of paragraphs, build keywords, scan and slow down when you find key points.\nEncoding\nUse your brain and engage with content.\nHow to study and learn\nResearch\ntriforce method\nspreeder to remove internal monologe\npoint at what you’re reading\nfind nuggets - 80/20 rule\nwrite summary / apply it\nwww.youtube.com/watch\nread visually, not verbally\nread the middle of words (contraversal)\nuse a pointer\nuse metrics\nwrite summary\nwww.youtube.com/watch\nargues trade off between comprehension and speed is too much\ninstead use “skimming”, look at toc, headings, etc\nhypothesizes that language processing is the factor\nwww.youtube.com/watch\nfiction vs non fiction distinction\nfiction use a summary from someone else, then skim it\nnon fiction\nhave a purpose in mind when reading\nmake a skeleton from TOC, build a learning map for yourself and allocate time appropriately\nuse your brain: how does it relate to you, argue with it, do a tedtalk on it, how does it impact future you - How to study and learn\nwww.youtube.com/watch\nconsider audiobook + actual book\nwww.youtube.com/watch\nif you have adhd, read multiple books at once - enter flow state by working on the things that seem most interesting at the time\nwww.youtube.com/watch\ngroup words\nalso, change format of book/website to improve efficiency\nwww.youtube.com/watch\nhow to focus on difficult stuffs\n\nscan for keywords to prime brain, these are the things you’re looking for\ndo the skeleton thing with the first sentence, make sure it is something you want to read. And then read it fast / slow, looking for important key points. similar to 80/20. Justin calls this burst.\nwww.youtube.com/watch\n\ndon’t read linearly, learn the order you need. 900 pages over 3 days?\nday 1: build general understanding, build anchor points\nday 2: return to anchor points to improve understanding\nday 3: focus on missed details\nwww.youtube.com/watch"},"04-PKM-and-Coding/PKM-and-Learning/How-to-study-and-learn":{"title":"How to study and learn","links":["trust-your-brain-mind-map.excalidraw","how-to-remember-what-you-read.excalidraw","motivation-dfuz.excalidraw","Drawing-2024-10-07-20.23.31.excalidraw","broken-barrel-learning-skills.excalidraw"],"tags":["permanent_note","public"],"content":"\nJustin Sung @drjustinsung\nJun yuh @jun_yuh\nAli Abdaal @aliabdaal\nZach Highley @zachhighley\nCollin the Chad @collinjunus\n\nJustin Sung\nAcademy weapon\nwww.youtube.com/watch\nwhat are the things that hold you back? - learning baggage. Invisible negative habits. They are cognitive habits.\nLearning is triggering techniques that happen in brain. Some of these techniques are negative, reducing memory and performance. This is how you can do the same thing as a top performer and get a different result. Make baggage visible with visible process mapping.\nGet major learning habits assessed. Justin Sung major learning habits assessment, mail.google.com/mail/u/0/#inbox/FMfcgzQXJZnmwGXcGbVnjTxmfkwSRHQW\nUse Visible Process Mapping - docs.google.com/document/d/1a7GXViRsJJtZtVD5s6yGTO57eh6r1dcN6SrOOWWzAk8/edit\nInfinite Staircase\nwww.youtube.com/watch\nlife is infinite staircase. challenges do not stop. each challenge is harder.\nto overcome challenge: three methods:\n\neffort first. reliance on your intelligence and motivation. leads to burn out\neffort second. first look at processes skills and attributes needed for challenge. and then develop them\nfuture proof approach. figure out next several challenges and upgrade appropriately.\n\nbut time?? 100 hrs of time. 80 is prep 20 is level 1 to level 2. + 10 hrs to level 6. time cost of upgrade is not linear.\n\nfigure out several next challenges\ntalk to people about those challenges. what were they and how did they over come? be humble.\ncreate list of priorities.\n\nYou’re Not Dumb: How to Mindmap as a Beginner\nwww.youtube.com/watch\nthesis: trust your brain\nTransclude of trust-your-brain-mind-map.excalidraw\nCreate mind map as final distill for connections and grouping. Ha, funny it was just a little tidbit at end of video.\nHow to Remember Everything You Read\nwww.youtube.com/watch\nTransclude of how-to-remember-what-you-read.excalidraw\nOkay, so what kind of information is being presented here?\n\nI’m applying mind map and ingest technique very quickly. Good. This is procedural.\nthis is conceptual information and… also procedural information. When taking in new information, what bucket does it fall into for how to process it? Identify bucket and then do that.\n\nHow to Force Your Brain To Be Motivated (when you don’t feel like it)\nwww.youtube.com/watch\nTransclude of motivation-dfuz.excalidraw\nThe best way to be motivated is to have a perfect external live and to always feel great internally. lol.\nkeep a distraction journal. ID distractions and work to eliminate them.\nWhat kind of information is being presented here?\n\nconceptual for sure. Each of those concepts have processes that can be applied to support it. But… well… okay, delink you can apply right now. Same with zone. And fake. And uptime.\n\nHow to Create The Perfect Mindmap (Advanced Guide)\nwww.youtube.com/watch\ngrinde\n\ngroup knowledge\nrelate those group to each other\ninterconnect one mind map to another, avoid islands\nwith these three, you’ve created a schema\nnon verbal, make little drawings, really good for learning new stuff\ndirection, should have arrows with a flow\nemphasized, should have areas bigger / bolder / more color, the “backbone” you’ll need to reorganize, that’s ok, part of recursive part of learning, its good\n\naka - “make it look pretty and understandable from a glance”\nTransclude of Drawing-2024-10-07-20.23.31.excalidraw\nI Taught 2000 People How To Study. Here’s What Actually Worked\nwww.youtube.com/watch\nwhen it comes to learning, personalized means effective\nbest method: focus on weaknesses, because of broken barrel analogy\n\nsilver bullet lol, doesn’t exist\nstrengths first, but you’re only ask good as your weakest skill, so no. Similar to Communication and Speaking 101#\n\ndeep processing (do you understand it)\nself regulation (self reflective of learning skills)\nmind set (willing to try and fail)\nrecall (spaced repetition)\nself management (are you a procrastinator?)\nTransclude of broken-barrel-learning-skills.excalidraw\nHow to Learn Complex Skills Quickly (And Forever)\nwww.youtube.com/watch\ncomplex skills are complex because of learning latency.\nLearning ------⇒ result\nlearning → result (tie shoe)\nRAIL\nrelevance, most effort is wasted because you are ignorant and don’t know what’s relevant. No knowledge guide rails or guide.\nawareness, aka pleau, gotta make lots of mistakes. But…\nOnce you know how to overcome the mistakes, doing it correctly happens by default.\niteration, secure your awarness\nlife long, gotta practice or it will decay\nbuahah, its actually just the conscious competence stages. the value add is what you do at each stage tho.\nA Simple Way to Learn New Skill (using science)\nwww.youtube.com/watch\nlearn slower, don’t try to do too many things at once. duh. I know this from dance. Also, he’s talking about balance, same as How to Remember Everything You Read.\n7 Years of Building a Learning System in 12 minutes\nwww.youtube.com/watch\nPERRIO\npriming your brain to learn. What do you do before an learning event? Class? Lecture? Study session? Tiago talks about this in second brain how he would review notes before meetings… people say wow so organized and smart! Nope, just primed.\nencoding: relationships, grouping, organizing, simplifying (thinking)\nreference: store it the details in Obsidian\nretrieval: use it, reorganize it, maybe reps\ninterleaving: look at the knowledge in another way, try new combos, different lights\nover learning: reps. Only needed for specific cases or very high competitive environments\nHow to actually stick to your schedule\nwww.youtube.com/watch\nover scheduling\nestimate double time\nflow state, you need to schedule your time ahead of time, not making cognitive decisions about what’s next\nbut what about getting everything done? doesn’t matter.\npick losses, play for championship\nmed school all over again\napply knowledge asap - think about how it is going to be applied, and then use that as framework for acquiring more knowledge. Can i do this with being a developer?\ncreate play senarios for situations where you might be able to apply knowledge in real world. learning anatomy - sweet home surgery practice example"},"04-PKM-and-Coding/SOPs/For-the-Love-of-SOPs-and-Documentation":{"title":"For the Love of SOPs and Documentation","links":["Quick-Start-to-Writing-SOPs","Which-SOPs-to-Are-Important-to-Write-First","How-to-Pick-the-Right-SOP-Platform","Neighborhood-mailer-marketing-sop","Drone-Photography-SOP"],"tags":["public"],"content":"SOPs contain the recipes of a company.\nThey lay the foundation for quality work and sustainable growth, making them particularly impactful to newer companies or smaller teams.\nI have distilled my experiences as COO and my training as an instructional designer into a concise set of articles to understand my approach to SOP writing, development, and best practices.\nIf you’re interested in developing SOPs for your company, I invite you to please take a look at the links below.\n\nQuick Start to Writing SOPs - Writing SOPs can seem overwhelming. Get started quickly with two simple steps.\nHow to Organize SOPs - Once you have a few SOPs and or documentation articles, the issue of how to organzine them arises. Here’s a quick summary on how to make your SOPs readable, findable, and easy to update.\nWhich SOPs to Are Important to Write First - Struggling with which SOP to start with?\nHow to Pick the Right SOP Platform - Where do you store all this information so your team can write and access it?\nNeighborhood mailer marketing sop and Drone Photography SOP are real life examples of SOPs that I’ve written for a real company.\nSOP Resources - Under construction. Soon to have some deep dives and additional resources.\nPKM system - Knowledge organization, acquisition, and production - How I approach my own knowledge management. These notes are a little harder to read since they’re meant to be read by me!\n\nIf writing SOPs is something I can help you with, I look forward to working with you soon.\n~Nicholas"},"04-PKM-and-Coding/scan-for-markdown-code-display-page":{"title":"scan-for-markdown-code-display-page","links":[],"tags":["public"],"content":"#!/bin/bash\n \n# Variable to fill in the target directory\nTARGET_DIR=&quot;/Users/tapzx2/repo/quartz/content&quot;\nSOURCE_DIR=&quot;/Users/tapzx2/remote-brain&quot;\nLOG_FILE=&quot;process_log.txt&quot;\n \n# Initialize log file\necho &quot;Process started at $(date)&quot; &gt; $LOG_FILE\n \n# Function to process markdown files\nprocess_markdown() {\n    local file=$1\n \n    # Check for the public tag in the front-matter\n    if awk &#039;/^---/{f=!f} f &amp;&amp; /tags:/,/^---/&#039; &quot;$file&quot; | grep -q &#039;\\- public&#039;; then\n        echo &quot;Found public tag in $file&quot; &gt;&gt; $LOG_FILE\n \n        # Copy the file to the target directory\n        cp &quot;$file&quot; &quot;$TARGET_DIR&quot;\n        echo &quot;Copied $file to $TARGET_DIR&quot; &gt;&gt; $LOG_FILE\n \n        # Scan for Obsidian-style media files ![[media]]\n        grep -o &#039;!\\[\\^*\\]\\]&#039; &quot;$file&quot; | while read -r media_link; do\n            # Remove the ![[ and |300 and ]]\n            media=$(echo &quot;$media_link&quot; | sed &#039;s/!\\[\\[//;s/\\|[0-9]*\\]\\]//;s/\\]\\]//&#039;)\n \n            # Log the found media link\n            echo &quot;Found media link: $media&quot; &gt;&gt; $LOG_FILE\n \n            # Find the linked media file\n            media_file=$(find &quot;$SOURCE_DIR&quot; -name &quot;$media&quot;)\n \n            # Log the path of the linked media file\n            if [ -n &quot;$media_file&quot; ]; then\n                echo &quot;Found media file: $media_file&quot; &gt;&gt; $LOG_FILE\n \n                # Check if the media file already exists in the target directory\n                target_media_file=&quot;$TARGET_DIR/media-files/$(basename &quot;$media_file&quot;)&quot;\n                if [ -f &quot;$target_media_file&quot; ]; then\n                    # Compare modification times\n                    if [ &quot;$media_file&quot; -nt &quot;$target_media_file&quot; ]; then\n                        # If the source file is newer, copy it and update the modification time\n                        cp &quot;$media_file&quot; &quot;$TARGET_DIR/media-files/&quot;\n                        touch -r &quot;$media_file&quot; &quot;$target_media_file&quot;\n                        echo &quot;Updated media file $media_file in $TARGET_DIR/media-files/&quot; &gt;&gt; $LOG_FILE\n                    else\n                        echo &quot;Media file $media_file is up to date in $TARGET_DIR/media-files/&quot; &gt;&gt; $LOG_FILE\n                    fi\n                else\n                    # If the file doesn&#039;t exist, copy it\n                    cp &quot;$media_file&quot; &quot;$TARGET_DIR/media-files/&quot;\n                    touch -r &quot;$media_file&quot; &quot;$target_media_file&quot;\n                    echo &quot;Copied media file $media_file to $TARGET_DIR/media-files/&quot; &gt;&gt; $LOG_FILE\n                fi\n            else\n                echo &quot;No media file found for: $media&quot; &gt;&gt; $LOG_FILE\n            fi\n        done\n    fi\n}\n \n# Function to remove non-existent links from markdown files, excluding embedded media\nremove_broken_links() {\n    echo &quot;Removing broken links in $TARGET_DIR&quot; &gt;&gt; $LOG_FILE\n \n    # Build a list of existing markdown files in TARGET_DIR\n    existing_files=$(find &quot;$TARGET_DIR&quot; -name &quot;*.md&quot; -exec basename {} .md \\;)\n \n    # Find all markdown files in the target directory\n    find &quot;$TARGET_DIR&quot; -name &quot;*.md&quot; | while read -r file; do\n        echo &quot;Checking file for broken links: $file&quot; &gt;&gt; $LOG_FILE\n \n        # Scan for Obsidian-style links link, excluding media embeds (![[...]])\n        ggrep -Po &#039;(?&lt;!\\!)\\[\\^+\\]\\]&#039; &quot;$file&quot; | while read -r link; do\n            #echo $file\n            # Skip embedded media (starts with ![[)\n            #if [[ &quot;$link&quot; == &#039;![[*&#039; ]]; then\n            #    echo &quot;Skipping media embed: $link in $file&quot; &gt;&gt; $LOG_FILE\n            #    continue\n            #fi\n \n            # Remove the  and  to get the link name\n            link_name=$(echo &quot;$link&quot; | sed &#039;s/\\[\\[//;s/\\]\\]//&#039;)\n \n            # Check if the link exists in the list of existing files\n            if ! echo &quot;$existing_files&quot; | grep -q &quot;^$link_name$&quot;; then\n                echo &quot;Found broken link: $link in $file&quot; &gt;&gt; $LOG_FILE\n                # Remove the [[]] around the broken link without overreaching\n                sed -i &#039;&#039; &quot;s/\\[\\[$link_name\\]\\]/$link_name/g&quot; &quot;$file&quot;\n                echo &quot;Removed link brackets from: $link in $file&quot; &gt;&gt; $LOG_FILE\n            fi\n        done\n    done\n}\n \n# Function to clean up TARGET_DIR\ncleanup_target_dir() {\n    echo &quot;Cleaning up $TARGET_DIR&quot; &gt;&gt; $LOG_FILE\n \n    # Find all files in TARGET_DIR\n    find &quot;$TARGET_DIR&quot; -type f | while read -r target_file; do\n        target_file_name=$(basename &quot;$target_file&quot;)\n \n        # Check if the file exists in SOURCE_DIR\n        if ! find &quot;$SOURCE_DIR&quot; -name &quot;$target_file_name&quot; | grep -q .; then\n            # If the file does not exist in SOURCE_DIR, delete it from TARGET_DIR\n            rm &quot;$target_file&quot;\n            echo &quot;Deleted $target_file from $TARGET_DIR&quot; &gt;&gt; $LOG_FILE\n        fi\n    done\n}\n \n# Create the media-files directory if it doesn&#039;t exist\nmkdir -p &quot;$TARGET_DIR/media-files&quot;\n \n# Cleanup target directory before processing\ncleanup_target_dir\n \n# Find all markdown files in the source directory and process them\nfind &quot;$SOURCE_DIR&quot; -name &quot;*.md&quot; | while read -r file; do\n    process_markdown &quot;$file&quot;\ndone\n \n# After processing, remove broken links from markdown files in TARGET_DIR\nremove_broken_links\n "},"05-Everything-Else/2005-Prius/Turning-a-3,500-Dollar-Prius-Breakdown-into-664-Dollar-Success":{"title":"Turning a 3,500 Dollar Prius Breakdown into 664 Dollar Success","links":[],"tags":["public","completed_project","Prius2005"],"content":"In August of 2022 I got the red triangle of death on my 2005 Prius.\nWhen the dreaded red triangle of death appears on the dash, it means something is seriously wrong. It often signals a major issue with the hybrid battery, which can be both costly and time-consuming to repair.\n\nA Prius battery issue isn’t as big of a problem on the West Coast, where these cars and repair services are plentiful. At the time I was living in Delaware, and local resources were scarce.\nCost and Risk Assessment\nAfter calling around I was quoted:\n\n$2,150 from a dedicated hybrid shop that would need the car for one week. However, it was hour drive and it was very possible I wouldn’t make it, incurring tow truck costs.\n$2,750 from a mechanic nearby with no warrenty.\n2,700 to 3,500 from the Toyota dealer down the street with a dubious warrenty.\n\n\nUsing napkin math I calculated the value of doing the work myself. If it took 70 hours of my time, using 3,000 as a baseline, I&#039;d be working/saving at 43.27 per hour. This would go down for any costs incurred and go up for any time saved.\nAfter a little research I learned that it was probably a few cells on the battery, not the whole shebang. Cells were 40 each I would probably need to replace three or four of them. After learning about the tools, I projected about 200 in equipment cost.\n\nAn estimated total cost of 360 and a budgeted 70 hours of time. Based on history, I double cost on projects that I have zero experience with. The time rate of 70 hours I had already inflated quite a bit. Doubling the expected cost to 720 still put me at a work/save rate of 32.57 / hr or 67k per year.\nWhile the tutorials were good and I had several engineer friends I could ask for help if things went south, I did have to accept the risk that it wouldn’t work at all. This would probably land me with the either the local mechanic or the Toyota dealer.\nBut in that case, I also had to accept the lack of warrenty from the local mechanics. The local mechanics didn’t have any experience with the Prius batteries. They would just have to figure it out. I couldn’t guarantee the quality of their work, but I was confident in my own abilities.\nWeighed these risks against the rewards, risking $720 to potentially save several thousand while picking up some interesting skills seemed worth it.\n\nIn the end, it cost me 664.73 and about 30 hours of labor spread across eight weeks. That&#039;s a work/save rate of 77.85 /hr or $161k per year. A pretty good deal!\nMajor Conveniences\nSome majorly helpful things:\n\nI had no immediate need for a car. I could easily and pleasantly bus/bike/walk/train to work, groceries, and entertainment.\nI was mostly work from home so I could watch over the battery during conditioning for safety reasons during the day.\nStephanie was out of town for 3 months.\n\nHaving Stephanie out of town was a huge help because no one else needed to use the car. And no one complained about the toxic gasses being emitted during the reconditioning process that forced me to leave the bedroom windows open through the night because it was a 1 bedroom apartment and the bedroom was the only place I could keep it where the cats wouldn’t climb on it and get electrocuted. Heh.\n\nProcess\nHere’s the project outline.\n\nconfirm battery issue\nresearch\nbuy tools and equipment\nremove the battery\ntest and recondition condition the cells\nbalance the battery\nre-install the battery\ndrive off into the sunset\nOf course, in the actual process there were 4 or 5 more “buy tools and equipment” and 9 or 10 “research” steps.\n\nTo efficient at managing my time, I would run the battery cell conditioning cycles twice a day. Starting in the morning before work and again about twelve hours later.\nChallenges\nI was living in a prim and proper apartment complex at the time and doing work on your car in the garage was not the kind of behavior or tenant that would have been acceptable.\nI couldn’t help but laugh as, in the dead of the night, I pulled the battery and carted it up to my apartment. I was fortunate no one saw me or complained.\n\nThe intent of anti car repair language was to prevent derelict looking cars, inconvenience to residents, and prevent safety issues. My plan, if someone complained, was to cite a passage in the lease clarifying that battery replacements were acceptable. Though it’s a big battery, it’s still just a battery!\nSome things I’d do differently:\n\nBuy the more expensive cells from the super wonk who does Prius battery reconditioning full time. Not going to him first meant I lost several weeks waiting after realizing the others I bought were worthless.\nSpeed up the conditioning process by buying balance chargers that could handle multiple cells at once.\nAt the time I wasn’t worried about it. But now after working in construction and knowing importance of safety equipment, I would buy (rent?) a fire extinguisher for electrical fires. The risk of fire is very low, but a fire extinguisher is not expensive and the danger is potentially catastrophic. It is a risk worth mitigating.\n\nResult\nSuccess! The voltage difference was down to .1 volts (excellent) and I came well within budget and time. Though… a little long on overall project duration.\n\nBonuses: It was fun. I got an excuse to learn about battery technology, electricity, and cars. It was also great conversation material.\nThe battery lasted over a year. Hurray! Once the cells start failing, others can will start to fail, so you’re looking at doing this work once every 12 to 18 months.\n\nIt failed again in October of 2023 but I was on the West Coast in Portland. I was super pressed for time, driving constantly to random locations, and the cost for an immediate battery replacement at my place was $1000 with a one year warrenty.\nIt was an easy decision to go with the replacement. Could I do it again? Yes, but I knew exactly what it would take to do the work and I didn’t have the time. I was extremely happy to pay someone else a reasonable price for a very convenient service."},"05-Everything-Else/Garden-Design":{"title":"Garden Design","links":["garden-design-education","Desert-Specific-Gardening"],"tags":["garden","public"],"content":"I love gardens! Both growing and visiting them. From 2015 - 2021 my focus was our Phoenix backyard garden. My inspiration came from visiting friends with productive yards and the dream boat Monty Don. The show Big Dreams Small Spaces was a huge catalyst. Right now I don’t get to get my hands dirty as much as I would like. Currently, I enjoy a visiting gardens around the world. I keep a very messy garden inspiration folder from my travels. Here’s a log of my garden design education.\nGardening in Phoenix\n2021\n \n\n2015-2018\n\n \nGardening in Phoenix was a bit of a challenge. People from Iraq are in the Phoenix gardening groups because we have a similar climate. It freezes enough to be dangerous to tropicals, it gets really hot, and there’s not much water.\nSome strengths of the Phoenix area: it was an agricultural center and has many of the legacy businesses, it has good dirt, and some very successful gardeners like Jake Mace, Shamus O’Leary, and Greg Peterson live here and provide free advice.\nSome great resources are Chip Drop and free stuff from neighbors and friends, and big sales at nurseries.\nThreats: disgruntled neighbors, city regulations, pests, and severe heat / cold.\nThe main tenants of the yard came to be:\n\nmake shade\nchoose abuse tolerant, edible plants\nmulch A LOT\nadd sulfur\n\nLinks\nDesert Specific Gardening"},"05-Everything-Else/Guayabera-Embroidery-Repairs":{"title":"Guayabera Embroidery Repairs","links":[],"tags":["sewing","public"],"content":"\ntake at 25% transparency and overlay in figma to get a lofi pattern\n\nquick refresher on icon creation in figma www.youtube.com/watch\nstart with shapes, have hidden properties i.e. star you can adjust point and make more points. values on right. “shape primitives”. extra spacing around shape is to establish center of mass. You can flatten shape and remove space. Keep in mind, will center better with bounding box on center of mass.\nVector points.\n\nlook at how different the A is from how I might draw it normally…\nclick on command / control and it will release beziay curve nodes. look at controls on right! you can really control things easily here.\nlook at bend tool for curves too.\nhold shift key for straight line\nsnap settings important to how you work. look at snap settings if you feel like it isn’t working correctly.\n37:00\nuse grid, make heart with 3 points.\nin figma with pen tool make vector design of pattern for reference so I don’t get lost\n\nfussing with rectangle shapes at bottom, happy enough with final one.\n\nhow to stablize? embroidery hoop from daiso, acquire tomorrow\n"},"05-Everything-Else/Map---Tango-and-Swing-Dancing-in-Seoul-Korea":{"title":"Map - Tango and Swing Dancing in Seoul Korea","links":[],"tags":["public","completed_project"],"content":"\nProcess\nSpec\nIssues\n\nI forget what I do on which day.\nThe calendar schedules are overwhelming + links don’t always work.\nThe internet is slow out of the house (map and calendars). Not easy to reference.\n\nWant\n\nEasy reference that’s fast.\nThe reference is easily updated and fun to make.\n\nSolution\n\nA map calendar.\n\nDesign\n\nWeb search for map inspo. Hand drawn looks nice!\nOutline base map area in procreate - easy future update if needed.\nImport to figma and add points - easy update + backed up.\nDesign escalator marks.\nUse colorbrewer2.org/ for color scheme.\nExport and add to Obsidian for sync to phone.\n\nSchedules\n\nref: Tango in Korea\n\nref: swing dancing in Korea"},"ACE":{"title":"ACE","links":[],"tags":["public","readme","reference_note"],"content":"forum.obsidian.md/t/the-ultimate-folder-system-a-quixotic-journey-to-ace/63483/4"},"Cyber-Security-Clearance-Level":{"title":"Cyber Security Clearance Level","links":[],"tags":["public","cybersecurity","reference_note"],"content":"\nConfidential Clearance\nSecret Clearance\nTop Secret Clearance / Sensitive Compartmented Information\n\nref: www.cyberdegrees.org/resources/security-clearances/"},"Dance---Private/Swing/Shag/Collegiate-Shag-Demystified---A-Simple-Progression-for-Professional-Dancers":{"title":"Collegiate Shag Demystified - A Simple Progression for Professional Dancers","links":["Dance---Private/Swing/Shag/Shag-Lexicon---Personal/skates","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/collegiate-kicks","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/shag-rhythms","basic---basic---shuffle-basic","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---single","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---triple","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---double","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---basic---step-kick","People-and-Memories/@Ryan-Martin","the-six-directions-of-movement","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---basic---arthur-murray-basic","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/bunny-hops","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/camel-hops","Dance---Private/Swing/Shag/Learning-Resources/LA-Style-Shag-Warmup"],"tags":["public","shag","swing"],"content":"There are two demographics I often teach collegiate shag. Strangely, they’re quite similar.\n\nabsolute beginners\nprofessionals\n\nIf someone is in between those two levels, I’m teaching them how to dance rather than what to dance.\nWith both beginners and pros, I use similar conceptual models and progressions. With pros, we’ll go behind the curtain of curated content and discuss it.\nThis is the progression I use for pro level dancers. For beginners, I’m often teaching them in groups and their experience is highly curated.\nThis progression is for professionals in a one to one session in about 1 or 2 hours. Adjust as desired.\nLearning Collegiate Shag Basics\nShag is One Pulse\nI conceptualize the base unit of shag as a single pulse.\ni.e.\n\nOne pulse = a quick\nTwo pulses = a slow\nThree pulses = part of fancy rhythms\nFour pulses = skates or collegiate kicks\nSix pulses = hesitation kicks\nEight pulses = kick throughs or skates\n\nYou can mix and match the pulses with weight changes to create shag rhythms.\n\nTry leading / following all of those standard rhythms with your feet together, just doing weight changes and applying the rhythms.\n\nIn shag, you’ll have the most success if you focus on the leg your weight is on. The free leg is the show, everyone looks at it, but it isn’t the important leg. Focus on the leg with your weight.\nShag Rhythms and Patterns\nAnd there are many Styles of the Shag Double-Rhythm Basic|shag footwork patterns. The one that will give you the most gains right away is the basic - basic - shuffle basic.\nLet’s add in quicks. When I practice alone and want reps, I usually do basic - rhythm - single or basic - rhythm - triple because they’re bilateral. This helps to avoid building too much asymmetry. Plus some really cool moves use these rhythms.\n\nDo the single and triple rhythm basic side by side.\n\nHowever, unless you’re dancing with other high level dancers, socially its 90% basic - rhythm - double.\n\nLead / follow different positions, turns, and passes. NO RHYTHM CHANGES.\n\nMix in the Step Kick + Scoot\nThe second basic to integrate is the basic - basic - step kick. This works well in all dance positions @Ryan Martin has listed in the Shag Lexicon except for closed. It kinda works in closed. I suggest using different basic for closed.\n\nTry just the step kicks (the slows) of the basic - basic - step kick\n\nThe most important part of this shag is the scoot. This scoot will make you efficient and save you from exhaustion. Introduce yourself to moving around with it.\n\nTry the the six directions of movement and focus on the scoot while doing the step kick.\nTry moving far and fast too!\n\nFor closed, I will often use the basic - basic - double kick as my default. This can be a regional thing. loc_Los Angeles will use this more. loc_Austin may use basic - basic - arthur murray basic.\n\nPractice transition from open to closed and changing basics. Use the basic - basic - shuffle basic or basic - basic - arthur murray basic in closed and then the basic - basic - step kick in open.\nIf time allows lead / follow different positions, turns, and passes and include transition into closed.\n\nPulse and Center of Gravity\nBeginners will often pulse high and stay there. Experienced shag dancers will use the whole spectrum. Socially, the important thing is to match with your partner. It will allow you to sync well and avoid exhaustion.\n\nTry high, medium, and low center of gravity while doing basic movements.\n\nRhythm work is being able to comfortably lead / follow however many pulses on each foot.  Use a relaxed tone and then when something changes, tone up, use more compression, try a lilt, or a hitch (or other level changes) to indicate a change. Once a rhythm is established, you can usually relax again.\n\nLead and follow mixed rhythms with feet together, just doing weight changes and applying the rhythms.\nLead and follow mixed rhythms in closed.\n\nMore Steps\nLet’s quickly skim some common and iconic shag motions to do before we’re done:\n\ncollegiate kicks\nbunny hops\nskates\ncamel hops\n\nConclusion\nOkay! That’s enough for the first session.\nFor the second session the focus is on the Getting the Scoot in Shag.\nChoose Your Own Adventure\nThere’s shag specific lead/follow technique in many of the patterns.\nFor future partnered practices:\n\nStart with rhythm work.\nDance a lot.\nPractice what you’re interested in.\n\nFor solo practices:\n\nFocus on the scoot.\nPractice turns.\nConsider: LA Style Shag Warmup\n"},"Dance---Private/Swing/Shag/Learning-Resources/LA-Style-Shag-Warmup":{"title":"LA Style Shag Warmup","links":["Dance---Private/Swing/Shag/Shag-Lexicon---Personal/skates","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/bunny-hops"],"tags":["shag/LAstyle","public"],"content":"www.youtube.com/watch\n0:25 skates\n0:36 fish out of water\n0:46 harvey wallbanger\n0:56 bunny hops\n1:08 fall off the log\n1:19 breaks"},"Dance---Private/Swing/Shag/Learning-Resources/Styles-of-the-Shag-Double-Rhythm-Basic":{"title":"Styles of the Shag Double-Rhythm Basic","links":["Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---basic---arthur-murray-basic","basic---basic---stab-basic","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---basic---step-kick","basic---basic---shuffle-basic"],"tags":["shag/classicShag","public"],"content":"www.youtube.com/watch\n\nBasic Patterns\n\n1:45 basic - basic - jig kick\n2:15 basic - basic - arthur murray basic\n\nbasic - basic - stab basic\n\n\n5:47 basic - basic - hook basic\n7:30 basic - basic - heels up basic\n8:48 basic - basic - single kick la style basic\n9:06 basic - basic - sailor\n10:19 basic - basic - lift basic\nin comments on YouTube: basic - basic - double kick\nnot listed: basic - basic - step kick\nnot listed: basic - basic - shuffle basic\n\nOthers\n\n1:02 stompers\n"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---basic---arthur-murray-basic":{"title":"basic - basic - arthur murray basic","links":["basic---basic---shuffle-basic","basic---basic---stab-basic","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---basic---arthur-murray-basic"],"tags":["shag/classicShag","public"],"content":"Can make three basics out of this\n\nbasic - basic - shuffle basic\narthur murray basic\nbasic - basic - stab basic\n\n\n@Jeremy Otth, @Amanda Pincock\n@Petite Krystal\n@Alexander Vinokurov\nNotice Alexander is doing the basic - basic - arthur murray basic, but Krystal is doing a basic - basic - hook basic\n"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---basic---step-kick":{"title":"basic - basic - step kick","links":[],"tags":["shag","public"],"content":"Leader footwork:\nS S QQ\nL R LR\n\nCall outs:\n\nLeft Right run run\nstep kick step kick run run\nslow slow quick quick\nONE two THREE four five six\n"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---double---long":{"title":"basic - rhythm - double - long","links":[],"tags":["public","shag"],"content":"vimeo.com/88253085\n12:57\nS S Q Q Q Q"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---double":{"title":"basic - rhythm - double","links":[],"tags":["public","shag"],"content":"S S Q Q"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---single":{"title":"basic - rhythm - single","links":[],"tags":["public","shag"],"content":"S Q Q"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---thirds---side-by-side":{"title":"basic - rhythm - thirds - side by side","links":[],"tags":["public","shag"],"content":"S   Q S   Q\n1 2 3 1 2 3\ncan be flipped to\nQ S   Q S  \n1 2 3 1 2 3\n\n2023-04-01 practice notes with @Joy Jing\nAdding a little pop make is easier to lead/follow and also makes it more visually obvious and performative.\nNeeds finessing to get back on proper timing since these are like triplets."},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---triple":{"title":"basic - rhythm - triple","links":[],"tags":["public","shag"],"content":"S S S Q Q"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/bunny-hops":{"title":"bunny hops","links":[],"tags":["shag","public"],"content":"see: Shag Lexicon"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/camel-hops":{"title":"camel hops","links":[],"tags":["shag/classicShag","public"],"content":"see Shag Lexicon"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/collegiate-kicks":{"title":"collegiate kicks","links":[],"tags":["shag","public"],"content":"see Shag Lexicon"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/shag-rhythms":{"title":"shag rhythms","links":["Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---single","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---double","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---triple","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---double---long","Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---rhythm---thirds---side-by-side","basic---rhythm---three-to-one"],"tags":["public","shag"],"content":"source The Rebirth of Shag\ntime stamp: 11:30\nTraditional Rhythms\n\nbasic - rhythm - single\nbasic - rhythm - double\nbasic - rhythm - triple\nbasic - rhythm - double - long\n\nModern Rhythms\n\nbasic - rhythm - thirds - side by side\nbasic - rhythm - three to one\nall quicks\nall slows\nfreeze breaks\n"},"Dance---Private/Swing/Shag/Shag-Lexicon---Personal/skates":{"title":"skates","links":["Dance---Private/Swing/Shag/Learning-Resources/LA-Style-Shag-Warmup"],"tags":["shag/modern","public"],"content":"See Shag Lexicon. Probably come from Drags. aka truckin’ see: LA Style Shag Warmup"},"Dance---Private/Swing/Swing-Dance-Competition-Accomplishments,-Awards,-and-Performances":{"title":"Swing Dance Competition Accomplishments, Awards, and Performances","links":["Special-Triple-Crown-Shag-Workshop---Sept-10th-2024"],"tags":["public"],"content":"\n2024 BCN Shag\n\nIn loc_Barcelona finalist for advanced mix and match and 4th in strictly\n\nAdvanced Mix and Match: www.youtube.com/watch\nStrictly\n\nall skate 1: photos.google.com/photo/AF1QipNvbkOcvCm7pb23UrMp95lPhqOZeXzLbe_zqzaR\nspotlights and all skate: www.youtube.com/watch\n\n\n\nSpecial Special Triple Crown Shag Workshop - Sept 10th 2024\n\nAn absolute honor to teach at the legendary @Triple Crown studio.\n2024 Bal Hop\n\nIn loc_Seoul finalist for bal hop cup, 3rd in shag strictly, 2nd balboa am m&amp;m, 1st in shag mix and match\n\nbalhop cup\n\nqualifiers:\n\nheat 1: www.youtube.com/watch\nheat 2: www.youtube.com/watch\n\n\nfinals: www.youtube.com/watch\n\n\nshag strictly\n\nqualifiers: www.youtube.com/watch\nfinals and spotlight: www.youtube.com/watch\n\n\nbalboa am mix and match\n\nqualifiers:\n\nheat 1: www.youtube.com/watch\nheat 2: www.youtube.com/watch\n\n\nfinals and spotlight: www.youtube.com/watch\n\n\nshag mix and match\n\nqualifiers\n\nheat 1: www.youtube.com/watch\nheat 2:\n\n\nfinals and spotlight: www.youtube.com/watch\n\n\n\nPerformance\nSwing performance at Pie Milonga in loc_Seoul\n2024 Swinging by the Sound\nSecond in advanced shag mix and match: www.youtube.com/watch\n2024 Portland Lindy Society Instructor\nRegular instructor of shag at weekly event.\n2023 Hot Jazz Jamboree\n\nSecond in shag strictly. Second in open mix and match shag. Third in mix and match balboa. Performance with LollyShaggers.\n\nShag strictly 2nd place: www.youtube.com/watch\nShag mix and match 2nd place: www.youtube.com/watch\nLollyShaggers video: www.youtube.com/watch\nBalboa mix and match Finals 3rd place: youtu.be/eKj4BTFvnck\n\nPortland State Faire 2023\n\nBackup Dancer for Rhythm Wrecker Dance Band\n2023 Swingin by the Sound\nSecond in advanced shag mix and match: www.youtube.com/watch\n2023 Hot Rhythm Holiday\nMix and match advanced shag finalist: www.youtube.com/watch\n2020 Camp Hollywood\nSecond in shag strictly. See results page www.youtube.com/watch\n2019 Camp Hollywood\n\nFirst place team results page www.youtube.com/watch\n5th place student team coach.\n\n2018 Swing Devils Competition\nFirst at the University Swing Club in Phoenix."},"Desert-Specific-Gardening":{"title":"Desert Specific Gardening","links":[],"tags":["garden","public"],"content":"Conclusions\n\nscreen soil for bermuda grass - doubles as decompaction for soil - add mulch or coconut coir for organic matter and aeration if you can wait out nitrogen drain. Sand also will work.\nIf caliche, consider clay spade or jack hammer\npH often 8+, consider sulfur soil amendments\n1 foot of mulch minimum\ntargeted drip watering\nuse downspout water\nuse ipomea batatas for ground cover\nuse moringa oleifera and ricinus communis for shade and as pioneers\nuse Chinese elm for long term shade and value, maybe mulberry\nstay away from plants that need frost to fruit i.e. apple, peach unless you can identify a microclimate\nficus carica, punica granatum, citrus, lavandula, grapes, malpighia emarginata, lemon grass, eggplant, ocimum basilicum, and roses are a breeze. Hot mediterranean often works well, but careful of the need for well draining soil.\n\nResearch\nJake Mace\nwww.youtube.com/watch\nShamus O Leary\nwww.youtube.com/@shamusoleary2139\nwww.phgmag.com/grow-miraculous-moringa-in-the-desert/\ninitial plant research phoenix garden"},"Diverse-Projects":{"title":"Diverse Projects","links":["05-Everything-Else/2005-Prius/Turning-a-3,500-Dollar-Prius-Breakdown-into-664-Dollar-Success","05-Everything-Else/Map---Tango-and-Swing-Dancing-in-Seoul-Korea","Sewing-Projects","05-Everything-Else/Garden-Design","04-PKM-and-Coding/SOPs/For-the-Love-of-SOPs-and-Documentation"],"tags":["public"],"content":"These are some projects, on going areas of responsibility, and hobbies. Some are technical (like fixing my Prius hybrid battery) and some are more design oriented (like a dance map calendar of Seoul).\n\nTurning a 3,500 Dollar Prius Breakdown into 664 Dollar Success\nMap - Tango and Swing Dancing in Seoul Korea\nSewing Projects\nGarden Design\nFor the Love of SOPs and Documentation\n"},"Drone-Photography-SOP":{"title":"Drone Photography SOP","links":[],"tags":["public","hawthorneGeneralConstruction"],"content":"Objective\nCapture comprehensive and visually appealing images before and after construction. These images will serve the dual purpose of facilitating project documentation and providing engaging marketing material. The goals are to showcase the property’s transformation, enhance material delivery efficiency, and provide liability documentation.\nProcedure\n\nDrone Pre-Flight Checklist\nPosition the drone to capture photographs from 8 directions. Front, both sides, back, and four corners. Take shots between 25 and 60 degrees. If this is a PostJob Inspection refer to the first set in CompanyCam for similar angles.\nHover the drone directly above the house. Set to 90 degrees. Capture a tight, overhead shot focusing on the house structure while. Do not cut off any part of the house.\nCapture a wide-angle shot that encompasses the entire house, including the driveway and drop-off area.\nApproach the roof closely to highlight details of interest\n\nAnything aesthetically pleasing\nShingle details\nRooflines\nSerious damage or issues\n\n\nDrone Post-Flight Checklist\n\nConsiderations\n\nIf there are flight hazards, exercise flexibility while capturing images.\nWeather Considerations for Drone Photography\n"},"Free-Spin-or-Peel-Away":{"title":"Free Spin or Peel Away","links":[],"tags":["shag","public"],"content":"Can be done both directions, but may not be cannon.\n2023-04-01 with @Joy Jing\nWould be really cute if it when to same foot as well in the chase section. Looks like when one turns and other doesn’t as well. Transition similar to like basic both face front leader.mp4"},"Garden-Design-and-Sketches":{"title":"Garden Design and Sketches","links":[],"tags":["garden","design","public"],"content":"\n\n\n\n\n\n\n\n"},"Garden/2023-Bamboo-Workshop---Portland-Japanese-Gardens":{"title":"2023 Bamboo Workshop - Portland Japanese Gardens","links":[],"tags":["garden","public"],"content":"Event Description\nBamboo Fence Workshop 2023 will be conducted by @Sadafumi Uchiyama (Sada), Chief Curator and Director of International Japanese Garden Training Center, a fourth-generation Japanese gardener from southern Japan. After a tour of the garden focusing on bamboo fences, there will be a discussion on types and styles, followed by a demonstration and hands-on tool practice and knot-tying session under the guidance of Sada and staff gardener.\nPhotos\nphotos.app.goo.gl/HxzmbRp4mGZhr9ib9\nLog\nDesigned wood fence is clear white cedar. Designed to replicate the visual depiction of a bamboo fence.\nBamboo quarter replace fence in the front of the house once a year. Depending on people that could be between 1 and 10 years for back of the house replacement.\nTea garden calls for the simplest form of bamboo fence. Typically it’s something that the team master or owner of the tea House will do.\nBamboo canes of Japanese garden can be prune frequently. This allows you to control both height and number and thickness. You can cut back to the ground. If The bamboo foliage is not heavy then the roots don’t have to push out and expand. This is the main thing that helps you control bamboo growth. Note that there are 600 700 year old bamboo portions inside homes In Japan that have not destroyed their courtyards or patios.\nTraditionally a student will go and make this fence in the master will fall behind them cutting off the knots that suck ass. The Masters will also be watching to make sure that they aren’t wasting too much material.\nFor cedar posts you can not dimension but harvest as is and use the round posts and it will last 50 to 100 years.\nThe fountain there is a clay pot that is upside down with a hole in it creates a resonating sound so that you can really hear the water. Every 20 years you have to take up the pot, clean up, put it back in.\nJapanese gardening there is constant maintenance and continuous improvement and never stops.\nFor Japanese pruting they’re doing incremental small pruning all the time particular focus on summer because that’s  when you’re outside. There’s no bad time to prune.\nOnce bamboo flowers its probably done. But, if you clear cut the whole thing or you could take off all the flowers it will prolong the life of the bamboo. The flowering cycle is 60 to 70 years (?) maybe. Depends on bamboo. There’s some really interesting research on the giant bamboo check it out.\nAge of bamboo 4 to 7 years is ideal before harvesting. 9 to 10 years it starts to deteriorate. September is the ideal time to harvest because it’s the time of lowest sugar content and the bugs won’t get in. This is in Japan where it has a clear four seasons.\nKakehi bamboo spout\nShishi odoshi deer chaser\nBamboo Design Options\n\nfences\ndelineations\ngrates\nfountains\nedging\ngutters\ndownspouts (travels outside of bamboo)\nerosion control (make little small fences then you plant all along those bamboo places and then in 15 years once the bamboo disintegrates you have a vegetative hedge that prevents the erosion)\nplant/tree supporters\nhide fire hydrants\nGate. Shiori-do gate.\nLadders. They are very stable and tell you much before they break.\nrakes, brooms, dustpans\n\nBuilding a Fence\nFor long bamboo fence think about 7 ft between posts. You can use bamboo horizontal to support in the middle so no sagging. Put groves in posts so bamboo can sit.\nNotice that top is node cut. On vertical pieces. This is my structurally sound and it traps due in the morning. This helps to slow down the drying process and prevent splitting.\nMaking the fence. Drive posts. End posts should be inches taller.\nKnot\nWorking on tying the fence… Make sure black twine is wet Don’t want to dry out. Do not allow any criss crossing of the twine think about parallel railroad tracks. Flip up the loop before pulling tight. You can pull single strands to pull tight.\nDon’t move your left hand once you’ve pinned it.\nThink about building and holding tension with the rope, not your hands.\nWhen making the transition of free end and creating the base end loop, the “aha” moment was realizing you can pitch with a longer part of your thumb and pointer. Not just the tip. This allows you to maintain hold on the loop pieces and slip the free end out of the pitch and allow the base end loop into the pinch.\nPeople\nCalPoly landscape architect. Look for professors who are working professional.\nloc_UNLV interior architecture is a really good program\n@James Chaddick"},"Garden/garden-anki/Principles-about-garden-elements---anki":{"title":"Principles about garden elements - anki","links":["Garden/garden-anki/balance---anki","Garden/garden-anki/proportion---anki","Garden/garden-anki/rhythm---anki"],"tags":["garden","design","public"],"content":"principles about garden elements\n\nbalance - anki\nproportion - anki\nrhythm - anki\n"},"Garden/garden-anki/Principles-about-the-garden-as-a-whole---anki":{"title":"Principles about the garden as a whole - anki","links":["Garden/garden-anki/order---anki","Garden/garden-anki/harmony---anki","Garden/garden-anki/unity---anki"],"tags":["garden","design","public"],"content":"principles about the garden as a whole\n\norder - anki\nharmony - anki\nunity - anki\n"},"Garden/garden-anki/Principles-specific-to-garden-design---anki":{"title":"Principles specific to garden design - anki","links":["Garden/garden-anki/flow---anki","Garden/garden-anki/context---anki"],"tags":["garden","design","public"],"content":"principles specific to garden design:\n\nflow - anki\ncontext - anki\n"},"Garden/garden-anki/balance---anki":{"title":"balance - anki","links":[],"tags":["garden","design","public"],"content":"balance: when the visual weight of design elements is equal on either side of an axis\n\nsymmetrical balance: mirrored image on either side of an axis\nasymmetrical balance: visual weight combined elements equal on either side of an axis\n"},"Garden/garden-anki/context---anki":{"title":"context - anki","links":[],"tags":["garden","design","public"],"content":"context in garden design is when\n\nthe design connects with the structure using color, material, shape, axises, and regulating lines\nthe design connects with the surroundings (genius loci) using views, materials, plants\n"},"Garden/garden-anki/flow---anki":{"title":"flow - anki","links":[],"tags":["garden","design","public"],"content":"flow is when\n\na garden is gradually reveled in stages\nglimpses of the next part of a garden and destination creates the incentive to move through a garden\n"},"Garden/garden-anki/garden-anki-study-MOC":{"title":"garden anki study MOC","links":["Garden/garden-anki/garden-anki-study-MOC","Garden/garden-anki/flow---anki","Garden/garden-anki/balance---anki","Garden/garden-anki/context---anki","Garden/garden-anki/unity---anki","Garden/garden-anki/garden-design-principles-groups---anki","Garden/garden-anki/harmony---anki","Garden/garden-anki/order---anki","Garden/garden-anki/Principles-about-garden-elements---anki","Garden/garden-anki/Principles-about-the-garden-as-a-whole---anki","Garden/garden-anki/Principles-specific-to-garden-design---anki","Garden/garden-anki/proportion---anki","Garden/garden-anki/rhythm---anki"],"tags":["MOC","public"],"content":"garden anki study MOC\nflow - anki\nbalance - anki\ncontext - anki\nunity - anki\ngarden design principles groups - anki\nharmony - anki\norder - anki\nPrinciples about garden elements - anki\nPrinciples about the garden as a whole - anki\nPrinciples specific to garden design - anki\nproportion - anki\nrhythm - anki"},"Garden/garden-anki/garden-design-principles-groups---anki":{"title":"garden design principles groups - anki","links":["Garden/garden-anki/Principles-about-the-garden-as-a-whole---anki","Garden/garden-anki/Principles-about-garden-elements---anki","Garden/garden-anki/Principles-specific-to-garden-design---anki"],"tags":["garden","design","public"],"content":"Principles about the garden as a whole - anki\nPrinciples about garden elements - anki\nPrinciples specific to garden design - anki"},"Garden/garden-anki/harmony---anki":{"title":"harmony - anki","links":[],"tags":["garden","design","public"],"content":"harmony: when a correct balance of variety and uniformity is achieved\nlook at: materials, colors, structures, shapes,"},"Garden/garden-anki/order---anki":{"title":"order - anki","links":[],"tags":["garden","design","public"],"content":"order: where everything is in its correct place\n\nclear function of different parts of a garden\nareas of different function defined\nlogical location of functions\nclear route with way-markers\n"},"Garden/garden-anki/proportion---anki":{"title":"proportion - anki","links":[],"tags":["garden","design","public"],"content":"proportion concerts the relative size of one object compared to another\nuse:\n\ngolden rectangle\ngolden spiral\nrule of thirds\npower of three\n"},"Garden/garden-anki/rhythm---anki":{"title":"rhythm - anki","links":[],"tags":["garden","design","public"],"content":"rhythm in garden: regular repetition of an element or groups of elements throughout a garden"},"Garden/garden-anki/unity---anki":{"title":"unity - anki","links":[],"tags":["garden","design","public"],"content":"unity: when an overarching style, layout, and/or theme unifies a design\n\nstyle: contemporary, cottage, court yard\nlayout: axial, rectilinear, circular, curvilinear, unstructured\ntheme: treble clef, international, math department\n"},"How-to-Pick-the-Right-SOP-Platform":{"title":"How to Pick the Right SOP Platform","links":[],"tags":["public"],"content":"Under construction.\nTL;DR The winners are\n\nNotion - great for collaboration, may need more buy in from teams\nGoogle Drive - what many small business are used to, a little clunky\nOneNote - same as Google Drive\nYour company’s current platform i.e. Atlassian\n"},"How-to-determine-a-neighborhood-area":{"title":"How to determine a neighborhood area","links":["Neighborhood-mailer-marketing-sop"],"tags":["hawthorneGeneralConstruction","public"],"content":"Using 1690 SW Hicrest Ave, Portland, OR 97225 as an example.\nNeighborhood is tied with identity. Usually the area the people move around in is what they consider their neighborhood. Google helps with this by establishing a neighborhood name on google maps. At this level, you can’t see it.\n\nZooming out a bit more we can see that this area has been designated Cedar Hills. When this happens, that’s great! It helps give us more information.\n\nIf this is the kind of region we’re looking for, great! This would be the full Cedar Hills area. If this area is too big for the use case, continue on.\n\nBecause we create mental borders at physical barriers i.e. a river will denote the line between one country and another. In suburban areas, larger roadways perform this function. Think about walking a dog, you would not go past the exterior perimeter of your neighborhood. For a short walk, you might not leave the sub sections. This is an example of how the major roads create the envelope, and the through roads create the sub divisions.\n\nOur target address is in the bottom right sub division so, let’s use that as our area. This will probably return about 100 houses, which is a good, affordable number if we’re planning on doing something like a message from Neighborhood mailer marketing sop\n"},"How-to-draw-a-polygon-in-qgis":{"title":"How to draw a polygon in qgis","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"\n\nCreate a new Shapefile Layer\n\n\n\nSelect the name and save location by clicking ... Make sure the save location is in a local folder designated for qgis projects.\n\n\n\n\nselect the polygon type\n\n\n\nTurn on editing by clicking the pencil.\n\n\n\nClick Add Polygon Feature\n\n\n\nDraw. Place more points by clicking further along the edge, until the shape you’re drawing completely covers the field. After placing your last point, right-click to finish drawing the polygon. Notice the school was excluded.\n\n\n\nSet the id to 1\n\n\n\nYou now have a polygon! You can see that it exists as well as toggle visibility in the Layers panel.\n\n\n\nTurn off editing by clicking Toggle Editing and click Save.\n\n\n"},"How-to-export-address-data-from-qgis-shapefile":{"title":"How to export address data from qgis shapefile","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"\n\nOpen the attribute table of the buildings that intersect with the drawn polygon.\n\n\n\nScroll through and do a quick data validity check. It should look like addresses. This one looks good.\n\n\n\nOpen the field calculator.\n\n\n\nCreate a new field named state. OSM data doesn’t come with it and Stannp will want it. Make sure this menu looks the same as what you’re putting in! Set the name to the appropriate state. Click OK.\n\n\n\nOpen field calculator again. Concatenate the house number and the street, set as “address”, (It says address 3 because this is just my 3rd attempt in my effort to blaze a path for you.) Make sure the menu looks the same! Click ok.\n\n\n\nExport by right clicking on the the layer Export &gt; Save Features As…\n\n\n\nSelect a folder and name the file.\n\n\n\n\nSave only the address columns, be sure to check the created “address” and “state” columns.\n\n\n\nSelect No Geometry.\n\n\n\nClick Save.\n\n"},"How-to-extract-house-number-data-from-OpenStreetMap-map-extent-in-qgis":{"title":"How to extract house number data from OpenStreetMap map extent in qgis","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"need: QuickOSM plugin\n\n\nUnder the menu open Vector &gt; QuickOSM &gt; QuickOSM\n\n\nIn the Key field, start typing addr and select addr:housenumber\n\n\nSelect For “In” select Canvas extent\n\n\n\nClick the Show query button. We’re going to remove some extra bits of information.\n\n\n\ndelete other types, leave just leave the way query.\n\n\n\nClick Run query\n\n\n"},"How-to-select-intersecting-buildings-with-polygon-in-qgis":{"title":"How to select intersecting buildings with polygon in qgis","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"starting with:\n\na main polygon\nhouse envelopes\n\n\n\n\nGo to Vendor &gt; Geoprocessing Tools &gt; Intersection\n\n\n\nSelect the Layers\n\n\n\nRun\n\n"},"How-to-start-a-new-project-in-qgis":{"title":"How to start a new project in qgis","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"\n\ncreate a new project\n\n\n\nUnder View &gt; Panels &gt; Layers, make sure the Layers panel is turned on.\n\n\n\nUnder Plugins &gt; Manage and Install Plugins make sure mmqgis, OSM place search, and QuickOSM are installed\n\n\n\nUnder the Browser panel, expand XYZ Tiles and double click OpenStreetMap. This should add a map of the world to the project.\n\n\n\n"},"How-to-zoom-to-an-address-in-qgis":{"title":"How to zoom to an address in qgis","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"\n\nGet the starting address. We’re going to use 1690 SW Hicrest Ave, Portland, OR 97225 as the example.\n\n\nMake sure OSM place search is checked\n\n\n\nInput the address in the Name contains... box. Click the -&gt; button.\n\n\n\nHighlight the returned address and click the Zoom button.\n\n\n\nThe map should now zoom to the address.\n\n\n"},"Installing,-opening,-and-basic-use-tips-for-qgis":{"title":"Installing, opening, and basic use tips for qgis","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"Because qgis is an open source project, it isn’t able to be verified easily by the MacOS operating system.\nInstall and Open\n\nwww.qgis.org/en/site/ download\non a Mac, RIGHT CLICK on the application the first time you open it. MacOS nerfs many options and this is a way to get around the first level of nerf.\n\nUse Tips\n\n\nqgis is a free open source tool. The other main tool is ArcGIS and it can cost up to $5,000 a year. Yes, qgis is clunky and sometimes irritating. But its free.\n\n\nFinding things is really easy using the help menu and typing in what you’re looking for.\n\n\n"},"Johnny-Decimal":{"title":"Johnny Decimal","links":[],"tags":["public","reference_note"],"content":"johnnydecimal.com/"},"Make-a-PDF-look-scanned-for-wet-signature":{"title":"Make a PDF look scanned for wet signature","links":[],"tags":["permanent_note","public"],"content":"When You Need a Wet Signature\nSometimes agencies/corporations/institutions want a “wet” signature on a piece of paper. If you can get away with the low resolution Mac Preview version, good for you! Can’t? Just print, sign, scan send. But no printer? Don’t speak the local language? Feeling cheap? Have to get a document done at 2am? Here’s how I did it.\nAdd High Resolution Signature to PDF Using Preview\n\nSign a piece of paper\nTake a photo of your signature\nUse adobe express to remove the background new.express.adobe.com/tools/remove-background#\nOpen in signature in Preview, reduce image size to 500 width 300 dpi.\nAdd images to existing PDF with Preview\n\nDo as follows:\n\n- Open the image you want to paste in Preview.app\n- Select All (Command-A)\n- Copy (Command-C)\n- Paste (Command-V)\n\nNow you have a copy of your image pasted above your old image. This is apparently meaningless, but the new copy is not just an image, but an object.\n\n- Click on the new image (round blue corners appear, no marching ants)\n- Copy (Command-C)\n- Paste on your PDF document. The image is an object, moveable and resizable. The original PDF is still a PDF, editable and all.\n\n\nNote There is the extra, non-obvious step of “pasting” the source image into the source image file before you can paste it into the target file.\nMake It Look Scanned\nIf you want to make it look scanned, you can use command line tools.\n\nbrew install imagemagick poppler\nconvert -density 130 input.pdf -colorspace Gray ouput.pdf\nThere are options to make it even more authentic, but I ended up with very heavy pdf files.\n\n\nSuper PDF Scan Code\n\nAutomate It\nFinally, if you need to do this frequently, automate it.\nbradt.ca/blog/how-to-make-a-pdf-look-scanned-imagemagick-automator-macos/"},"Manual-Use-of-Stannp-Online-Platform":{"title":"Manual Use of Stannp Online Platform","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"Proprietary info."},"Neighborhood-Mailer-Copy":{"title":"Neighborhood Mailer Copy","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"Proprietary info."},"Neighborhood-mailer-marketing-sop":{"title":"Neighborhood mailer marketing sop","links":["What-our-ideal-roof-jobs-look-like","How-to-determine-a-neighborhood-area","Installing,-opening,-and-basic-use-tips-for-qgis","How-to-start-a-new-project-in-qgis","How-to-zoom-to-an-address-in-qgis","How-to-draw-a-polygon-in-qgis","How-to-extract-house-number-data-from-OpenStreetMap-map-extent-in-qgis","How-to-select-intersecting-buildings-with-polygon-in-qgis","How-to-export-address-data-from-qgis-shapefile","Send-direct-mail-to-neighbors","Neighborhood-Mailer-Copy","Manual-Use-of-Stannp-Online-Platform"],"tags":["hawthorneGeneralConstruction","public"],"content":"Objective\nSend a direct mailer marketing touch to a desirable area around a job site.\nProcedure\n\nDetermine if the neighborhood area is a good target. What our ideal roof jobs look like\nDetermine the target of the neighborhood area. How to determine a neighborhood area\nOpen qgis. Installing, opening, and basic use tips for qgis\nPrepare the workspace. How to start a new project in qgis\nZoom to the starting address. How to zoom to an address in qgis\nZoom out so the target area is framed in the map extent. Try using cmd - for major zooms. The scroll wheel on the mouse is a little fussy in qgis but is good for smaller increments. \nDraw a polygon of the target neighborhood area. How to draw a polygon in qgis\nExtract house numbers from OSM map extent. How to extract house number data from OpenStreetMap map extent in qgis\n\nLimit the address to those intersecting the drawn polygon. How to select intersecting buildings with polygon in qgis\nExport the addresses to a .csv file. How to export address data from qgis shapefile\nOpen Stannp. Create a new group and import the file.\nSend Mailer in Stannp. Use the Send direct mail to neighbors for the design, the Neighborhood Mailer Copy for copy, and input via Manual Use of Stannp Online Platform\n"},"Obsidian-Systems-Business/write-concept-notes-with-propositional-titles":{"title":"write concept notes with propositional titles","links":[],"tags":["concept_note","public"],"content":"source: Matuschak0000WritingNoteTitles\nExamples of Propositional Titles\nfrom Seitz2021StarterPack\nTo modify “love thy neighbor” you might say “Loving your neighbor is vital for a well-functioning society”.\nHere’s a few examples (italics) of how I was writing note titles, and how I’ve been trying to write them recently (bold)\nRelationship between art and truth becomes Art is a means of disclosing reliable, true knowledge.\nLiteracy of Puritans in late 18th century America becomes American Puritans of the late 18th century were highly literate.\nLearning through linking becomes Linking ideas together helps us remember ideas and use them.\nYou get the idea. By distilling down a note into a single claim, it will help you focus the writing, and when scanning a list of titles or trying to write a link, you’ll be able to retrieve a claim from memory much faster than a vague suggestive title."},"PARA-System-Quick-Start":{"title":"PARA System Quick Start","links":["Obsidian-Systems-Business/write-concept-notes-with-propositional-titles"],"tags":["reference_note","public"],"content":"System\n4 (5) categories\n\ninbox: (optional)\nprojects: completable and have an end date\nareas of responsibility: a quality, standard, or responsibility to maintain over time for your role\nresources: interests, curiosities, passions, hobbies (not responsibilities!)\narchives: anything not active\n\nWorkflow\n60 second setup guide\n\nstart fresh by archiving everything and put a date on that folder\ncreate project folders\ncreate an inbox (optional)\ncreate additional folders as necessary\n\nOnly create additional folders as necessary. Never create empty folder or tag until you have something to put in it.\nRefinement\nProject refinement\n\nconfirm projects are not an area of responsibility.\nbe able to define workload of project\n\nFolder Refinement\n\nNumber the folders.\nStandardize naming convention. i.e. emojis start projects, capital starts areas of interest, uncapitalized starts resources\nactivate offline mode for projects and inbox folders\nmake backups\nbe flexible. It doesn’t matter that you have 4 main categories. Two works: i.e. Hot - Cold. Or add a systems folder for 6.\nUse same organizational system on everywhere. Each system adds mental load.\n\nUpkeep\n\nretitle new items in inbox to something useful. Same vein as -  write concept notes with propositional titles\nSort in to para - will this help me move a current project forward? yes - projects. will this help me uphold an area of responsibility? yes - aor. Interest? Otherwise, delete. This also helps refresh work / ideas that have been done too.\nUpdate active projects. Move stuff to archives or out of it.\n"},"People-and-Memories/@Ryan-Martin":{"title":"@Ryan Martin","links":[],"tags":["shag","public"],"content":"Swingin’ By The Sound\nTABLE author\nFROM #shag/classicShag \nWHERE contains(author, [[@Ryan Martin]])"},"Quick-Start-to-Writing-SOPs":{"title":"Quick Start to Writing SOPs","links":[],"tags":["public"],"content":"The key to quickly writing SOPs is to write them with incrementally increasing detail. This is done with two painfully obvious steps.\n\nStart with a broad concept\nAdd more detail\n\nAs a completionist, I used to be shipwrecked by SOP projects where fully accurate processes were difficult or impossible to collect or create. Training myself to work incrementally and forgetting about an immediate need for depth of detail, rescued these projects. \nTo see this incremental process, below is an example of creating a first draft SOP over three iterations. The whole process can be expected to be produced in a fast session, about 30 to 45 minutes.\nLet’s begin!\nFirst Iteration\n\nIdentify the “what”.\n\nThe “what” defines the title of the SOP. A good title distills the SOP into a single concept. This is achingly important but if you don’t know of a good title, that’s okay! It can be changed later. \n\nDefine the “why”.\n\nThe “why” defines the objective. A good objective quickly gets to the point. Think 1 or 2 sentences. If it’s a bit verbose, that’s okay! We can refine it later.\nThe prompt: We are writing an example SOP for new employees working the cash register (the what) because we need someone to the run the cash register that’s not you and you want it done well (the why).\nOur first draft title could be something like: Standard Operating Procedure for Retail Employees Working the Cash Register. This isn’t the most compelling title, but it is clear.\nThe objective could be something like Objective: To ensure smooth operation of the cash register while providing excellent customer service in line with our company mission.\nNow that we have the title and objective, let’s incrementally add detail.\nLevel 1 Detail\nProcedure\n1. Start shift\n2. Handle transactions and issues\n3. End shift\n\nGreat, that took all of 10 seconds! Let’s add another layer of detail to End shift. We would normally do this for each step, but for readability I’m only going to add it to one of the steps.\nLevel 2 Detail\nEnd your shift\n1. Close the register\n2. Count and confirm accurate cash count\n3. Prepare the cash drawer for the next day\n4. Prep supplies for next shift\n\nLevel 3 Detail\nNow we’re getting into the nitty gritty… Let’s adding more detail to Close the register.\nClose the Register\n1. Stop transactions\n2. Print the end-of-day report\n3. Secure and deliver report\n\nLevel 4 Detail\nIn this SOP, now we are getting into the literal button pushing! We may not go into this level of detail in a first draft. In some cases, it is best avoided because this can become a significant time commitment! If we’re lucky, we can use documentation that already exists. In the case of our POS system, it does.\nStop transactions\n\n\nRef\n\nStandard Operating Procedure (SOP) for Retail Employees Working the Cash Register - First Iteration\nAfter showing the process of adding details, I filled a few other things out. This can start to feel a bit overwhelming. However, this is a good first draft and starting off point for writing an SOP.\n### Objective\nTo ensure smooth operation of the cash register while providing excellent customer service in line with our company mission.\n### Procedure - First Draft\n1. Start Your Shift\n\t1. Log in with your assigned ID\n\t2. Count and confirm accurate cash count\n\t3. Check supplies\n2. Handle Transactions\n\t1. Greet the customer\n\t2. Run the transaction\n\t3. Thank the customer\n3. Handle Issues\n\t- Price discrepancy\n\t- Returns or exchanges\n\t- Transaction error\n\t- Irate customer\n1. End Your Shift\n\t1. Close the register\n\t\t1. Stop transactions\n\t\t\t1. Refer to stoneedge.com/kb/articles/pos-ending-a-shift/  ![POS-Shift-Close.png](stoneedge.com/kb/wp-content/uploads/2019/04/POS-Shift-Close.png)\n\t\t2. Print the end-of-day report\n\t\t3. Secure and deliver report\n\t2. Count and confirm accurate cash count\n\t\t1. Remove the cash drawer and count the cash\n\t\t2. Separate bills and coins\n\t\t3. Record the totals for each denomination\n\t\t4. Compare this total with the end-of-day report from the register\n\t\t5. Identify and report discrepancies\n\t3. Prepare the cash drawer for the next day\n\t\t1. Set aside the starting amount\n\t\t2. Prepare the drawer\n\t\t3. Deposit remaining cash\n\t4. Prep supplies for next shift\n\t\t1. Double-check that the register is locked and secured\n\t\t2. Clean and organize\n\t\t3. Return keys and reports\n\t\t4. Confirm there are bags and receipt paper\n\t\t5. Check out with supervisor\n\nPlanning the Second Iteration\nAfter the first iteration is completed, we can step back for a minute and think about how we quickly refine it and use it to help make some business decisions.\n\n“Deposit remaining cash” (step 1.3.3) is mission critical and could highlighted a little better in SOP.\nWe do not have the capacity to write the button pushing level of detail into our SOP nor do we have the capacity to train employees who might need that. This can help lead to writing clear job requirements. It may be important for the applicant to have some experience with POS systems or an aptitude for learning. Maybe in the future we would look into writing the button pushing docs. But for now because we’re trying to get this position filled.\nHandling issues could be considered critical. This jumps to the top of the list of SOPs to write.\nWe can probably prune the detail from the customer interaction, cash count, and supply check instructions. We’d would hire someone who’s good at this already. In the future, when a more robust training methodology is needed i.e. dutch bros training, then we could expand this.\n\nUsing the above points, the first draft can be tidied up into something like this.\n### Procedure - Second Iteration\n1. Start shift with a cash count and supply check\n2. Handle Transactions\n3. Handling Issues\n\t- Price discrepancy\n\t- Returns or exchanges\n\t- Transaction error\n\t- Irate customer\n1. End Your Shift\n\t1. Close the register\n\t2. Stop transactions\n\t3. Do cash count and prep cash drawer for tomorrow \n\t\t1. Remove the cash drawer and count the cash\n\t\t2. Separate bills and coins\n\t\t3. Record the totals for each denomination\n\t\t4. Compare this total with the end-of-day report from the register\n\t\t5. Identify and report discrepancies\n\t\t6. Set aside the starting amount\n\t\t7. Prepare the drawer for next shift\n\t4. Deposit cash by placing it in the cash pouch and going to First Republic Bank, deposit to the Yarns and Things Account. Do this after every shift before 5:30pm.\n\t5. Prep supplies for next shift \n\t\t1. Double-check that the register is locked and secured\n\t\t2. Clean and organize\n\t\t3. Return keys and reports\n\t\t4. Confirm there are bags and receipt paper\n\t\t5. Check out with supervisor\n\nPlanning the Third Iteration\nAfter organizing, the result is a tidy looking SOP that clearly sets expectations of our new employee. Using these expectations it will sharpen the job positing. It has also helped hight light the things we would need to provide to the new employee and set them up for success.\nHowever, it is a little unwieldy to scan and requires too much reading. There are also some steps that can be made their own SOPs.\nThere is also a question for the critical cash system of what happens if the employee misses the cash deposit cut off? After a quick think about this system, we can implement an updated version. The square brackets indicate links to another SOP. In the SOP platform they would look more like this: How to Organize SOPs.\n### Procedure\n1. Start shift with a cash count and supply check\n2. Handle Transactions\n3. Handle Customer Issues - Customer Policies\n4. Shift End Process\n5. Deposit cash by placing it in the cash pouch and going to First Republic Bank, deposit to the Yarns and Things Account. Do this after every shift before 5:30pm. If needed, you can use the night depository for an after hours deposit.\n\nAs an architect type planner, I used to be caught in the productivity trap of over designing systems. This was reflected in the SOPs It is helpful to keep in mind Gall’s law and remember that complex systems that work come from simple systems that work.\nThis 5 step SOP is a great first draft. It is simple, clear, and given us clarity on the next documents that need to be written. Thanks for hanging with this example until now!\nAfter writing 10 to 20 of these documents, we’ll need an organization system. Please have a look at How to Organize SOPs for a quick tour of organization principles."},"Ryan-on-Stephen-and-Chanzie-Style-aka-Double-Kick-Basic":{"title":"Ryan on Stephen and Chanzie Style aka Double Kick Basic","links":["People-and-Memories/@Ryan-Martin","Dance---Private/Swing/Shag/Learning-Resources/Styles-of-the-Shag-Double-Rhythm-Basic"],"tags":["shag","public"],"content":"@Ryan Martin in comments on YouTube video of Styles of the Shag Double-Rhythm Basic:\n“@Stephen Sayer|Steve and @Chandrae (Chanzie) Roettig Gomez|Chanzie have a unique style. But if I had to place them, I’d say they have the most in common with Connie and Barbara (Basic #5). They don’t really have a lilt in their basic. Yet there is a very small amount of movement at the waist (like Connie and Barbara), which probably tells the follow what count her partner is on (like a lilt does). So it doesn’t make sense to lump them in with the folks that do the whole heels up business (basic #4). And they hold a wider gait, like Connie and Barbara. The most important thing, though, is the fact that they’re super smooth. Smoothness can be a relative thing, of course (i.e., a lilted basic can be smooth too, but it’s a different kind of smooth). My point is, Connie and Barbara’s smoothness shows in the fact that their heads don’t move up and down hardly at all during the basic, which is the way Steve and Chanzie dance. They make it look effortless. …I think Sailor Mike would also be a part of this same LA tradition. Smooth. Very little bounce. It works really well to faster music.”"},"Send-direct-mail-to-neighbors":{"title":"Send direct mail to neighbors","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"Proprietary info."},"Sewing-Projects":{"title":"Sewing Projects","links":["05-Everything-Else/Guayabera-Embroidery-Repairs","Want-Give-Have-Had/How-to-Get-Men's-Pants-for-Dancing"],"tags":["sewing","public","area_of_interest"],"content":"2024-09-13 Guayabera shirt sleeve repair. Starting project file on Guayabera Embroidery Repairs\n2024-09-09 Epoxy repair + added canvas patch on heel of left shoe and small reenforcement on part of shoe that has frayed on right. Would have preferred white, but could only find canvas in yellow. Better than no shoe!\n\n\n2024-08-06\nSmall hole repair on sweatpants. A far cry from Japanese technique for repairing holes kaketsugi, but perfectly acceptable. Used theory from visible mending technique for clothes. Wouldn’t mind a loop next time.\n\n2024-05-01\nTote Bag 2. Reversible. Thinking about color and theme, I selected for transportation. Muted base with pops and dot pattern.\nIntro to Sewing Class\n\n2022-05-22\nAttempt at tailoring shirt. Disaster. With practice would be good. Not that difficult, but maybe more challenging to get right on first attempt. Recommend continuous practice on same shirt.\n\nAttempt at tailoring pants. Success. Small pucker. First properly waisted pants EVER. VERY excited about them!!! Featured in later article: How to Get Men’s Pants for Dancing 5 or 6 attempts at getting this right. Very forgiving.\n\n2022-03-20\nShorts? Underwear? Not sure. Freeform attempt at making coverings for bottom half. Didn’t take into account seam allowance. Can’t fit on body.\n\n2022-03-18\nTote bag 1. Got cheap fabric from goodwill table cloth. Functional. Ugly. Good first!!!\n"},"Special-Triple-Crown-Shag-Workshop---Sept-10th-2024":{"title":"Triple Crown Shag Workshop Lesson Plan and Retrospective","links":[],"tags":["public"],"content":"Contents\n\nSpecial Triple Crown Shag Workshop - Sept 10th 2024#Retrospective|Retrospective: What went well, what could have been better.\nSpecial Triple Crown Shag Workshop - Sept 10th 2024#Notes for While Teaching|Notes for While Teaching: Quick memory triggers for teaching.\nSpecial Triple Crown Shag Workshop - Sept 10th 2024#Long Outline|Long Outline: Class plan with reasoning and options.\nSpecial Triple Crown Shag Workshop - Sept 10th 2024#Development Process|Development Process: Used to develop plan. Has collected ideas and marketing.\nSpecial Triple Crown Shag Workshop - Sept 10th 2024#Testimonial from El about Triple Crown Workshop|Testimonial: A very good one!\n\nRetrospective\nBanana analogy didn’t work for me. Rocking a baby worked much better to create the lilt.\nTelling people “I am going to use the phone as a memory trigger outline because when I get excited I get distracted, and I’m so very excited to teach this class.” Was excellent for contextualization. Consider printing outline out. Or maybe even writing on mirror? Would like to try both in future. Phone is great for portability, but does provide a visual trigger reminder to others to look at their phone. Maybe not an issue, but would like to try other methods.\nI was very limited on speaking in class because it was to mainly Korean audience and wanted to avoid translation time suck. Was nice to speak less, but I did get a little more sever perhaps, how to be more positive anchor without voice?\nLost Marcy. How to adjust class to keep her? She’s a good dancer and spoke English, but was frustrated. Was she panicked because of her fear of shag? Maybe a quick meditation or calm verbal cues would have helped.\nGood feedback from more skilled dancers. Less skilled dancers found it difficult. As expected for a workshop, so that’s good, but try to get ahead of any negative thoughts. Consider: “please review this workshop in 1 year and it will help you tremendously” and “show this video to your teacher and work through it together” and “you can always message me with questions” sentences to final speech.\nShould have gotten media right away. Consider getting an iPhone just for easy media transfer.\nMany thoughts on this and created:\nHow to Leverage Group Class as Funnel\nNotes for While Teaching\nWarmup\n\nkick and shuffle\nsingle and triple\nEfficiency\nbalboa\nscoot\npulse in lower half, not whole body\nlazy shuffle\nFloaty\nposition and move follow along, degrees, hands, pass by, turn, sliding doors\ncreate a move\nwant timing, take class at triple crown\nPure Shag\nUSA vs Korea mentality\nWeight change leading\nbanana leading\nLet’s try distance leading\nLet’s try rotational\nLet’s try hand to hand what techniques, or combinations of techniques could you use?\nTurn Timing\nbalboa uses gears, shag uses paddles\nfrom hitches, quick, slow turn, both sides\nfrom run run, qq turn both sides\n\nsmall routined\nextended basic\ntriplett basic\n3 slows 2 quick turn\nopposite wall banger\nshag lollies\npassbys\nnicholas break\nEnd of class speech\nThank you for letting me share my perspectives on shag. Perhaps ask yourself, how do I build upon tradition? What can I contribute?\nStephen and Chanzie are a great example of building upon tradition, vomit comet and Harvey wall isbanger were not shag moves before they did them.\nFinally, Thank you very much to Soochan and Young for giving me this platform and letting me teach here. And Thank you for being here, I appreciate your focus and attention.\nLong Outline\nWarmup\nOne song warm up with just step kick, back shuffle, and hitch\nOne song of of single and triple, with step kick and back shuffle\nEfficiency\nshow shuffle, differentiate between Arthur Murray and stab basic\nshow kick, emphasize soft knees and gentle scoot → if kick basic is terrible, take a 15 minute detour at some point, but this is optional\nLand of Double\nFollow along\n\nclosed to open, do shuffle in closed, do either in open\ndo position changes, open, two hand, one hand, 90, 45, facing, switch to cross hand, face front and back, back to two hand, try sliding doors\nthis is floaty easy going timing aka, no timing.\nplease think of a lindy move, strip the timing, and then try to use shag basics while doing it\n\nLand of Timing\nLand of timing, This is a more typical class where you have a specific movement pattern and you do it at the set timing. Soochan and Young teach excellent classes with a great diversity of movement. I have been training here and I quite enjoy it.\nPhilosophy Break\nIn USA I tell people: know the rules to be able to break them. Because people in the USA don’t want to learn the rules.\nIn Asia, this isn’t a problem. Instead, maybe consider that you are an artist, not a preservationist. Respect tradition by building upon it.\nLand of Rhythm\nWith that in mind, let’s move to the land of rhythm. This is where I hope to have contributed to shag. Let’s try leading and following rhythms. “Pure Shag”\nWeight change leading\n\nquiet, small\nslow rhythm\npulse rhythm\nto music\n\nLets try banana leading (aka lilt)\n\nfeet should width apart\nrib cage warmup\nfollowers hand on rib cage\n\nslows and extra slows\nslows and quicks\n\n\n\nLet’s try distance leading\n\nslows have a side step, quicks are in place\ntry by your self\ntry lead and follow\n\nLet’s try side by side (okay to skip this one)\n\nwhat techniques, or combinations of techniques could you use?\n\nThink about hand to hand (okay to skip this one)\n\nwhat invented techniques, techniques, or combos would work here?\n\nTurn Timing\nUse rotational (use as transition from rhythm section) hitch basic in open\n\nfull change is slow, half way is quick\nuse hitch and pony\n\nTransition to turns\nbalboa uses gears\nshag uses paddles (not sure the right analogy here)\n\nhitch basic repeat\n\nl/f a qq turn\nl/f a slow turn\nUse either or as pay attention step. When showing use only inside turns to protect shoulders.\nMention at end that you can do outside\n\n\nrun run basic\n\nl/f a qq turn. Here’s the vocalization, be sure to practice this!! The “turn” is the prep movement. 1 2 3 4, turn 2 3 4, 1 2 3 4, 1 turn 3 4\nl/f a slow turn → weird, but doable, do it on your own time, not very shag. Practice it before class, don’t show this, but be prepared for the question.\n\n\n\nSmall Routine\nif time!\nextended basic\ntriplett basic\n3 slows 2 quick turn\nopposite wall banger\nshag lollies\npassbys\nnicholas break\nEnd of Class Speech\nThank you for letting me share my perspectives on shag. Perhaps ask yourself, how do I build upon tradition? What can I contribute?\nStephen and Chanzie are a great example of building upon tradition, vomit comet and Harvey wall banger were not shag moves before they did them.\nFinally, Thank you very much to Soochan and Young for giving me this platform and letting me teach here. And Thank you for being here, I appreciate your focus and attention.\nDevelopment Process\nSent in description: Join us for “Mastering Collegiate Shag Rhythms,” where you’ll honor tradition while crafting your own sophisticated shag rhythms and steps. This workshop dives deep into advanced techniques, focusing on efficient movement that keeps you dancing all night. Be prepared to sweat as you refine your ability to lead and follow intricate rhythm changes, syncing perfectly with your partner. Whether you’re a seasoned dancer or have solid shag experience, this session will elevate your skills and bring new precision to your dancing.\n\nfor decent dancers or experienced with shag, maybe a little tricky for beginners but they could handle it if they were willing to struggle\npartnered, but it isn’t required to have a partner. I can work with an imbalanced class as long as it isn’t too extreme\n90 minutes would be great\nwe’ll establish a framework for creating our own moves\nwe’ll work on making rhythms and how to lead and follow them efficiently\nwe’ll trouble shoot some common syncing issues\nwe’ll apply those rhythm changes in closed, double two handed open, and single hand side by side\nwe’ll work on the scooting action across several of the basic steps\nwe’ll work on leading and following different turn timings (if we have time)\n\nImportant Points from Published Marketing\ngoal: a variety of people will be able to dance shag\nI will help you create your own sophisticated rhythm and steps in the tradition of Collegiate Shag.\nAnd while matching with your partner, you can develop the ability to lead and follow complex rhythm changes.\n\nLeading and following rhythm changes of closed, double two-hand, open, and single hand\nBuilding a framework\nSome basic steps of squatting movements\nLeading and following movements for various turn timings\n\nWe prepared this with the hope that various people will be able to perform various shags on the dance floor in the future.\nTranslated Marketing in Bulk\nInstagram\n#섀그특강\n지난 발앤합에 홀연히 나타나\n발보아, 린디, 섀그 대회를 휩쓴 니콜라스.\n20년차 탱고 댄서이자\n7년차 섀그 댄서로서\n트리플크라운에서 섀그 특강을 진행합니다.✨✨\n————————————\n🙋‍♂️안녕하세요 니콜라스입니다. 🙌\n한국에서 첫 특강을 준비하며\n열정적인 한국댄서들의 모습을\n자주 상기했습니다.🤔\n앞으로 댄스 플로어에서\n다양한 사람들이 다양한 섀그를\n출 수 있기를 바라는 마음으로 준비했습니다.\n곧 만나요😉\n————————————\n▶ 대 상 : 섀그 유경험자(초보자도 OK)\n▶ 일 자 : 9월 10일 (화) 저녁 7:30 ~ 9:00 (90분)\n▶ 금 액 : 3만원 (별도 비용 없음)\n▶ 강습 장소\n\n서울시 마포구 양화로 8길 32-8  ’트리플크라운 스윙댄스 아카데미‘\n\n▶ 자세한 내용은 신청링크(링크트리) 참조해주세요❤️\nforms.gle/Qij8kRUori6DH9bVA\n★ 문의\n\n전화(070-4139-9311) 또는 인스타그램 DM(@triplecrown_swingdance)\n\nNicholas, who suddenly appeared at the last Bal &amp; Hop\nand swept the Balboa, Lindy, and Shag competitions.\nAs a 20-year tango dancer\nand a 7-year shag dancer\nI will be giving a shag special lecture at Triple Crown. ✨✨\n🙋‍♂️Hello, this is Nicholas. 🙌\nWhile preparing for my first special lecture in Korea\nI often thought of the passionate Korean dancers. 🤔\nI prepared this with the hope that in the future,\na variety of people will be able to dance a variety of shags on the dance floor. See you soon 😉\n————————————\n▶ Target: Shag experience (beginners are also OK)\n▶ Date: September 10 (Tue) 7:30 PM - 9:00 PM (90 minutes)\n▶ Fee: 30,000 won (no separate fee)\n▶ Class location\n\n32-8 Yanghwa-ro 8-gil, Mapo-gu, Seoul ‘Triple Crown Swing Dance Academy’\n\n▶ For more information, please refer to the application link (Link Tree)❤️\nforms.gle/Qij8kRUori6DH9bVA\n★ Inquiries\n\nCall (070-4139-9311) or Instagram DM (@triplecrown_swingdance)\n\nGoogle Form\n[Shag Special Workshop with Nicholas]\n지난 발앤합에 홀연히 나타나\n발보아, 린디, 섀그 대회를 휩쓴 니콜라스.\n20년차 탱고 댄서이자\n7년차 섀그 댄서로서\n트리플크라운에서 섀그 특강을 진행합니다.\n탱고의 정밀함과 섀그의 활기,\n그 절묘한 조합을 즐긴다는 니콜라스.\n전통을 기반으로 새로운 리듬과 형태 탐구로\n섀그 연구에 열정적인 그가\n한국 댄서들에게\n찐 현지의 섀그 맛을 전해준다고 합니다.\n\n안녕하세요 니콜라스입니다.\n한국에서 첫 특강을 준비하며\n열정적인 한국댄서들의 모습을\n자주 상기했습니다.\n먼저\nCollegiate Shag의 전통에\n자신만의 세련된 리듬과 스텝을\n만들 수 있도록 도와드릴 거예요.\n그리고\n파트너와 호흡을 맞추면서\n복잡한 리듬 변화를 리드하고\n팔로우하는 능력을 키울 수 있습니다.\n\n클로즈드, 더블 투핸드, 오픈, 싱글 핸드의 리듬 변화에 대한 리딩 팔로잉\n프레임워크 구축\n몇 가지 기본 단계의 스쿳팅 동작\n다양한 턴 타이밍의 선행과 후행 동작\n\n앞으로 댄스 플로어에서\n다양한 사람들이 다양한 섀그를\n출 수 있기를 바라는 마음으로 준비했습니다.\n► 대 상 : 섀그 유경험자(초보자도 OK)\n► 일 자 : 9월 10일 (화) 저녁 7:30 ~ 9:00 (90분)\n► 금 액 : 3만원 (별도 비용 없음)\n  - 입금계좌 : 카카오뱅크 3333-04-8893770 강일규\n  ※ 카드결제, 현장접수 가능. \n  ※ 취소 및 환불은 [9월 6일(금)] 까지 가능합니다.\n▶ 강습 장소\n  - 서울시 마포구 양화로 8길 32-8  ‘트리플크라운 스윙댄스 아카데미’ \n★ 문의\n  - 전화(070-4139-9311) 또는 인스타그램 DM(@triplecrown_swingdance)\nCollected Thoughts Throughout Month\nfor developing ideas, thinking about bilateral or trying the same thing in many different ways\nthis is not a shortcut to practicality, this is a space for creativity\nfor turns\nbalboa uses gears\nshag uses paddles (not sure the right analogy here)\n\nhitch basic repeat, l/f a qq turn, l/f a slow turn, pay attention between either or. Use only inside turns. Mention at end that you can do outside\nrun run basic, l/f a qq turn, 1 2 3 4, turn 2 3 4, 1 2 3 4, 1 turn 3 4, l/f a slow turn → weird, but doable, do it on your own time, not very shag\n\nThinking about Tuesday class\nMaybe different shag basics is interesting for the slows\nAlso maybe 4 different traditional basics\nConcept of chill and scoot, how to be efficient, think Balboa\nThinking about how to lead and follow - tango weight changes, banana shape, travel vs no travel\nQuicks, slows, Collegiate kicks, skates → repeat\nThinking about types of quicks. Shuffles, pumps\nShag\n4 basics\nBasic gliding\nChanges positions\n2 basics of slow\nMany qucks side by side\nMany qudina in front, use ha of slow to prep\nThinking about workshop…\nWhat about level of pulse?\nStart with 6 minute warm up:\n\nKick step\nDouble kick\nSailor\nSingle kick\nChugs\nBack tap\nDouble kick front\n\nIn USA: know the rules to be able to break them.\nIn Korea: Respect tradition by building upon it.\nStephen and Chanzie are a great example, vomit comet and Harvey wall banger were not shag moves before they did them.\nI have asked myself how do I build upon tradition? What can I contribute?\nSo, I share with you a way thinking about shag.\nShag is one pulse.\n1 = q\n2 = s\n3 = idk no name\n4 = skates or collegiate kicks\n5 = idk no name\n6 = could be kick throughs\nSolo, these are two bilateral basics.\nUse any of the basics and try single time.\nUse any of the basics and try triple time.\nNow, try one of my basics\n123 1 12 12 12\nPlease, take 5 invent a basic and practice it. Build upon tradition. It doesn’t have to be bilateral.\nOkay, please partner up. Teach your basic to your partner. You have 2 minutes each.\nMy answer has been “pure shag.” In the way Balboa has a rich dance in closed, I believe shag has the same. Uding these subtile and intricate communications, we can grow was we can communicate in open figures.\nI don’t know if it will catch on, it’s a very hard thing to entertain a crowd with. Huge benefit is that is that it is socially sustainable. Much less taxing (maybe). In a crowded room it’s hard to do shag. Bal is better. But only because bal knows how to be small. Much of shag requires opening.\nPerformance vs social dance.\nOkay, now let’s set a Rhythm. Use one of the four standard rhythms. And change the physical basic.\nOkay let’s partner and lead follow just weight changes.\nScoot basic\nRunning man\nScoot forward and back with kick\nKeep it simple\nWhat about starting with just the step kick.\nNo talking\nDo a lot of those.\nDo running man.\nDo hop back and forth no kick.\nHop back and forth with kick.\nBack to step kick.\nAdd a single and triple time.\nMove around the room.\nThis is maybe 6 to 10 minutes. Water.\nOkay good warmup!\nIntroduce weight changes exercise. Do it. A few rotations.\nTry switching to between single, double, triple, or extended double.\nNow try free form.\nKorea v America\nTool I use is one pulse. This covers freezes.\nHave every one try. Use in pulse idea. And any physical basic you know / like / want to try. I.e. kick, tap shuffle.\nGo back to weight change lead follow practice. Rotate a few.\nNow, let’s try a very shuffling basic. In fact, what does this look like?. Balboa right? One of my secrets of shag efficiency is to think Balboa. I see the feeling of energy and try to replicate it and it’s exhausting. Instead, find ease.\nDemo solo dancing.\nLead and follower rhythm changes with a shuffle basic.\nI think about building upon tradition and I think this is how I’m doing it. I think of pure shag the way that pure bal works. It isn’t great for performance, but it is exceptional for understanding lead follow and that’s been great for me in bigger motions.\nEach type of basic has their own tricks to leading and following. Ones with a slight side to side or lilt are the easiest. The step kick basic is quite hard. It’s what I’m working on now.\nOkay, let’s crank up the energy a little bit and start the step kick basic again. It’s what we use almost entirely in open so it’s very very good to get good with.\nWe do the running man to love the scoot to know and feel the scoot. Let’s restart those.\nDo a lot of those.\nDo running man.\nNow step kick. Now forward and back. Now circle. Left right.\nRunning man again.\nBack to step kick.\nAdd a single and triple time.\nMove around the room.\nThis is maybe 6 to 10 minutes. Water.\nOkay, now let’s talk about floating. No touching and gestures to get places. Key is to not force timing. Either leader or follower.\nNow, let’s talk about asking for timing.\nOutline\nWarmup (scoot prep)\nRespect tradition by building upon it\n\none pulse\npure shag\nBalboa efficiency\nsolo dancing\npure shag again\nScoot practice\nsolo reps / running man\nfloating as a style\nvs scoot spring\nTurns timing\nlead off of a…\n\nslow\nquick\n\n\nto lead a\n\nslow\nquick\n\n\n\nTestimonial from El about Triple Crown Workshop\nFrom Dongyun Shin aka El www.instagram.com/elsdy/\nThe lesson yesterday was amazing. The practice exercises you prepared to explain the concept and the way you built upon each concept step by step were excellent. Personally, it was very similar to the way I organize things, so it was easy for me to learn.\nAlthough it was only an hour and a half, I was able to better understand and think about the overall energy management in Leader-Follower Shag, and how to dance in a way that the Follower enjoys more and we can dance together for a longer time. It was incredibly helpful.\nThe concept of leading through energy management, such as weight shifting, the “banana” or “baby-sitting” techniques, and distance, is not only applicable to Shag but also to other dances as well. It was great to see how seriously Nicholas takes dancing and how well he organizes his thoughts.\nI have no doubt that you will become an amazing dancer, and I look forward to seeing your future growth. I really wish we could spend more time together and talk more, but it’s a shame that we can’t. Still, I am so grateful to have met you, such a wonderful dancer, in Korea. Though our time together was short, every conversation we had was heartfelt, and I could see how thoughtful and sincere you are. Every time, I could feel what a great person you are.\nI wish you the best in your future endeavors, and I hope you’ll come back to Korea someday. Until then, I’ll keep dancing, and I hope we can look forward to meeting again. Truly, you’re not only a great dancer but also a great person.\nSay hello to Stephanie for me, take care of your health, and when are you leaving?"},"Tango-Class-Recaps":{"title":"Tango Class Recaps","links":[],"tags":["public","tango"],"content":"Tango Class Recap Videos\nBack hooks\n\nocho cortado variations\n\nRock steps\n\nDisassociation\n\nThe Cross\n\nQuick Quick Slow\n\nSandwiches\n\nThe Basic Step\n"},"Want-Give-Have-Had/How-to-Get-Men's-Pants-for-Dancing":{"title":"How to Get Men's Pants for Dancing","links":["People-and-Memories/@Ryan-Martin"],"tags":["swing","public"],"content":"I’m very fortunate that swing and tango pants share a similar style. This has been a literally years long process to find pants for dancing that look good and fit right. Hoping this will save someone else some pain. If you just want the bullet points, go to the How to Get Men’s Pants for Dancing#Conclusion aka TL;DR Get Pants Made|TL;DR.\nwww.instagram.com/reel/C_6ZvAEJYr0/\nWhere’s the Waist\nClothes come standard. Bodies do not.\nThere are three measurements to start with.\n\nWaist\nHigh Hip\nHip (aka your booty)\n\nThere is almost no pair of pants pants you can buy today in a regular store that are made to fit at your actual waist. Pants today are made for your high hip.\nBut where’s your waist?\nIn the gym communities, waist is often defined as the narrowest part above the iliac crest and below the bottom ribs. This can be difficult for some to find reliably (again, because bodies are different) so one common piece of advice is to use the measure at your belly button as an alternative. On me, my belly button is actually below my waist.\nThis is what those lines look like on me. Please forgive the gym progress selfie.\n\nOn a skeleton those points would look like this. The waist however, may not be where I drew the line. The narrowest part could be slightly lower or higher. I just guessed.\n\nWhen you take a look at people showing how to measure for trousers, they sometimes generalize the terminology. In this video, the “waist” being measured is what I use the term “high hip” for.\n\nThe Gentleman’s Gazette wrote an article on some of the terms used for pants and what they can do for different bodies. In this image they’re talking about low, mid, and high rise pants. Mid rise pants just aren’t a thing for me, they are super uncomfortable and don’t stay in place.\n\nMy legs are a little bit on the shorter side and my hip / torso a little longer. This means pants at high hip for me are not going to look good like they do on @Ryan Martin. Ryan is tall and has long legs. I haven’t seen him shirtless so I just guessed where is waist is.\n\nThe pants that I theorized would good on me are pants that sit on the waist. This is boxer John Hazel in 1948 wearing a beautiful pair of pants.\n\nThe very first pair of pants to fit me the way I wanted were these. Notice my belly button isn’t visible because it is lower than my waist.\n\nHow to Figure Out Pants For You\nRight now my waist is 37”, my high hip is 39”, and my hip (booty) is 46”.\nIf by some stroke of luck I could find pants that were made to fit at my waist (aka high rise) and not my high hip (aka low rise), off the rack won’t fit. Any pants that fit my waist aren’t making it past my thighs and booty. Pants that fit my booty are going to balloon around my waist.\nIt took a lot of trial and error before I realized my body isn’t the problem. It is the off the rack clothes. I’ve tried on lots of pants. Realized that I needed pants that fit me, not me trying to fit my body to pants.\nI bought pants from Goodwill that fit my hips, were high rise, and were the style I was looking for. Then, I learned ONE skill in sewing to fix the waist.\n\nIf you don’t know what looks good on you, what I suggest having a light meal and then head over to a well stocked Goodwill and try on A LOT of pants. Take photos. Do this at multiple locations across several weekends. You may need to bring some binder clips to take up some of the fabric when viewing in the mirror.\nPleats\nTo look swing, it is generally better to have pleats.\nHow many to get is up to you and your tastes. Also your pant maker might have something to say about the subject. HOWEVER, if you like the way your body looks with out pleats, find a make it work for your style.\nColor\nI went with solid black a blue with a light pinstripe. I’m on the road a lot and wanted base colors that would match with most everything and everyone I danced with.\nMy daily drivers are black, and dark blue with pinstripe. I have had other colors like olive, khaki, brown, grey, and green in the past and I LOVED them but they just aren’t practical for me on the road. Spilling a very visible spot of oil on your khaki pants is a sure way to spoil the mood at the after party late night dinner. Especially if you need to wear those pants again in the competition tomorrow. With black it is a non issue.\nFabric\nOf course I want wool. Wool was is financially practical. And my pant maker doesn’t offer it. He recommended a light synthetic that doesn’t wrinkle easily and I’ve had no complaints.\nLength\nThis depends on your overall style choice. This video shows some LA legends and their varying pant lengths. @Jeremy Otth floods a ton. @David Frutos doesn’t flood any. @Stephen Sayer’s pants are in between where the socks show well when moving, but not really when just standing.\n\nI went with the flood while in motion look. I need my pants to work outside of swing dancing but I wanted the pop of color since I usually am in darks because of travel.\n\nI recently got one more pair of black pants that were several inches longer because it looks so not tango to show socks like this.\nSuspenders\nIf you wear suspenders without the alligator clips, you can get the buttons sewn to the inside of the pant waist when you get them made. You have to ask for this. If you’re really fancy you can wear President Shirley suspenders like @Sam Chan.\nCuff\nI prefer a cuff. Some people prefer none. In tango the follower’s heel can get stuck in a cuff. I have had this happen to me, but only once. For some dancers I’ve talked to it has been a regular issue and they have sworn off cuffs.\nStyle Note - Tuck the Shirt\nIf you can, tuck the shirt. AHHHHH, Why didn’t I tuck this?? The whole point of the higher waist is to make the line higher on the body to give the visual of longer leg lines. Oh well, live and learn.\n\nHere’s that same outfit with the tucked shirt. My legs aren’t stubby anymore.\n\nNot all shirts tuck. For this guayabera I opened the shirt and tucked an undershirt so I could still show the waist line from the front.\n\nConclusion aka TL;DR Get Pants Made\n\nI get pants from www.facebook.com/okiz.baek. He will ship.\nIf in Korea you can also get them from www.facebook.com/bbangnim\nUnless your legs are long, get your pants made at waist height.\nFlood, color, cuff, and pleat to your needs and style.\nFabric will be synthetic, wool is $$.\nPrice will be around 120 to 150 USD including shipping.\n"},"Website/test-file":{"title":"test file","links":["05-Everything-Else/2005-Prius/Turning-a-3,500-Dollar-Prius-Breakdown-into-664-Dollar-Success"],"tags":["public"],"content":"Private link: @Nicholas Tapia\nPublic link: Turning a 3,500 Dollar Prius Breakdown into 664 Dollar Success\nembedded image\n\nembed video\n"},"What-our-ideal-roof-jobs-look-like":{"title":"What our ideal roof jobs look like","links":[],"tags":["hawthorneGeneralConstruction","public"],"content":"We’re looking for single story ranch style homes with space around the property and minimal vegetation.\nA 27 sq 4/12 house with no valleys and 3 facets. Many of the surrounding homes are similar in style. A perfect example!\n\nWe are not looking for difficult properties. Things that make a job difficult are steep pitch, tight lots, many facets, multiple stories, or shared roof ownership like town homes. These things often cause delays and increased risk.\nThis is an example of a job that we generally don’t want. It will keep the company running, but won’t grow it.\n"},"Which-SOPs-to-Are-Important-to-Write-First":{"title":"Which SOPs to Are Important to Write First","links":[],"tags":["public"],"content":"under construction\nTL;DR\nDepending on your situation, pick one of these.\n\nThe ones that free the most time.\nThe simplest ones to write.\nThe ones you want hire for.\n"},"basic---basic---shuffle-basic":{"title":"basic - basic - shuffle basic","links":["Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---basic---arthur-murray-basic"],"tags":["shag/modern","public"],"content":"Do less lift that basic - basic - arthur murray basic. It is very similar to a balboa shuffle. Great for lazy efficient dancing."},"basic---basic---stab-basic":{"title":"basic - basic - stab basic","links":["Dance---Private/Swing/Shag/Shag-Lexicon---Personal/basic---basic---arthur-murray-basic"],"tags":["shag/modern","public"],"content":"Derived from basic - basic - arthur murray basic\n\n@Minn Vo @Corina Acosta"},"basic---rhythm---three-to-one":{"title":"basic - rhythm - three to one","links":[],"tags":["shag/modern","public"],"content":"S     Q S     Q\n1 2 3 4 5 6 7 8\nL L L R L L L R\n\nCan be flipped to start on R of course\nCan be made bilateral with a little effort i.e.\nS     Q S   Q Q\n1 2 3 4 5 6 7 8\nL L L R L L R L\n"},"garden-design-education":{"title":"garden design education","links":["Garden/2023-Bamboo-Workshop---Portland-Japanese-Gardens","Desert-Specific-Gardening","Garden/garden-anki/garden-anki-study-MOC"],"tags":["garden","design","public"],"content":"garden design: using design principles to create a garden that will accommodate the uses needed by the owner\nEducation\n2024\nMaking a Landscape Master Plan in Morpholio Trace\nThe Complete Garden Design Course - 1 Design Principles\nThe Complete Garden Design Course - 2 Drawing Techniques\nThe Complete Garden Design Course - 3 How To Design\nThe Complete Garden Design Course - 4 The Process of Design\n2023\nGardening MasterClass with Ron Finley\n2023 Bamboo Workshop - Portland Japanese Gardens\n2018\nDesert Specific Gardening\nBill Mollison - Permaculture Two -Practical Design for Town and Country in Permanent_Agriculture\nShort Garden Design PDFs\n2017\npermaculture basics\nAnki Cards\ngarden anki study MOC"},"index":{"title":"Welcome!","links":["03-Infill,-Construction,-and-Planning/Infill-and-Missing-Middle-Real-Estate-Development","02-Dance/Swing-and-Tango","Diverse-Projects","04-PKM-and-Coding/How-I-Publish-This-Site---Obsidian-with-Quartz"],"tags":["public"],"content":"\nHello! Welcome to my personal site. It is under construction.\nMy name is Nicholas Tapia, I’m currently a fractional COO, traveling the world, and dancing.\nIn my free time I research knowledge management, practice my Spanish, and do some mini design projects. In the past I ran a roofing company, started a venue rental company, and worked as a cyber security analyst at JPMC.\nMy vision for the future is to build an online dance school and contribute to meaningful work in infill development.\nAreas of Focus\n\nInfill and Missing Middle Real Estate Development\nSwing and Tango\nDiverse Projects\nHow I Publish This Site - Obsidian with Quartz\n"},"learning-and-teaching-partner-dance-progression":{"title":"learning and teaching partner dance progression","links":[],"tags":["public","writeme"],"content":"Low lofi to high fi.\nBasic pattern solo x1\nBasic pattern solo x2\nBasic pattern solo x4\nTo music, solo x1, x2, x4, x8\nWith a partner, in open, x1, x2, x4, (x8)\n\ndo x1 to x3 times with each partner before calling rotate\nWith a partner, in open, to music, x1, x2, x4, (x8)\ndo x1 to x3 times with each partner before calling rotate\n\nEach item in this progression contains multiple skills beyond just doing the pattern. When teaching or self teaching (aka learning) identify the skills that are important to you and then use them as checks before moving on. When teaching a group class, you can adjust your expectations for the % of people who “get it”. I am for 90 to 95% before moving on. If the skill sticks, you don’t have to keep doing it.\ni.e.\nDoing the basic pattern x1\n\ndo they have the physical ability (not skill) to do it at all?\ndo they start on the correct foot?\ncan they keep the timing?\nDoing the basic pattern x2\ndo they start on the correct foot the second time?\ncan they keep the timing?\nDoing the basic pattern x4\ncan they get to 4 w/o loosing the pattern?\nlook for appropriate technique upgrades that will help with dancing with a partner i.e. feet closer together, more/less scoot, more/less pulse\n\nHow much or how little progression are applied depends on your audience. Super advanced class? Show them the pattern once or twice and let them try it. Then look for spots to refine. Do it to music and have them add it to their normal dancing."},"the-six-directions-of-movement":{"title":"the six directions of movement","links":[],"tags":["public"],"content":"forward, right, basic, left, rotate right, rotate left"}}